[
  {
    "id": 1,
    "savol": "Huquqni muhofaza qilish organlari fani mohiyatini yoriting.",
    "javob": "Huquqni muhofaza qilish organlari fani — davlatning huquqiy tartibotni ta’minlash, qonuniylikni mustahkamlash hamada inson huquq va erkinliklarini himoya qilishga qaratilgan faoliyatini, ushbu faoliyatni amalga oshiruvchi organlarning tuzilishi, vakolatlari va ish prinsiplarini o‘rganuvchi fan hisoblanadi."
  },
  {
    "id": 2,
    "savol": "Oʻzbekiston Respublikasi Sudyalar assotsiatsiyasining tashkil etilishi asosiy maqsadi.",
    "javob": "Asosiy maqsad — sudyalar hamjamiyatini jipslashtirish, sudyalarning mustaqilligini ta’minlashga ko‘maklashish, ularning huquqlari va qonuniy manfaatlarini himoya qilish, sud tizimini takomillashtirish bo‘yicha takliflar ishlab chiqish va sudyalik kasbi nufuzini oshirishdan iborat."
  },
  {
    "id": 3,
    "savol": "Sud hokimiyati deganda nimani tushunasiz?",
    "javob": "Sud hokimiyati — davlat hokimiyatining mustaqil tarmog‘i bo‘lib, u qonun chiqaruvchi va ijro etuvchi hokimiyatlardan mustaqil ravishda, faqat sudlar tomonidan odil sudlovni amalga oshirish (fuqarolik, jinoiy, iqtisodiy, ma’muriy ishlar va konstitutsiyaviy nazorat) orqali amalga oshiriladi."
  },
  {
    "id": 4,
    "savol": "Korruptsiyaga qarshi kurashish sohasidagi islohotlar.",
    "javob": "Asosiy islohotlar: 'Korrupsiyaga qarshi kurashish to‘g‘risida'gi qonunning qabul qilinishi, Korrupsiyaga qarshi kurashish agentligining tashkil etilishi, davlat xizmatida 'komplayens-nazorat' tizimining joriy etilishi, davlat xaridlarining shaffoflashishi va sohani raqamlashtirish orqali inson omilini kamaytirish."
  },
  {
    "id": 5,
    "savol": "O‘zbekiston Respublikasi prokuratura organlarining yagona markazlashtirilgan tizimini taxlil qiling.",
    "javob": "Prokuratura tizimi vertikal bo‘ysunuvga asoslangan: quyi prokurorlar yuqori prokurorlarga va O‘zbekiston Respublikasi Bosh prokuroriga bo‘ysunadi. Bu tizim qonunlarning butun mamlakat hududida bir xilda va aniq ijro etilishini ta’minlash, mahalliy hokimiyat ta’siridan mustaqil bo‘lish uchun xizmat qiladi."
  },
  {
    "id": 6,
    "savol": "O‘zbekiston Respublikasi prokuratura organlari faoliyatining huquqiy asoslari nimalardan iborat?",
    "javob": "Huquqiy asoslarni O‘zbekiston Respublikasi Konstitutsiyasi, 'Prokuratura to‘g‘risida'gi Qonun, Bosh prokurorning buyruq va yo‘riqnomalari, shuningdek, jinoyat-protsessual, fuqarolik-protsessual va boshqa qonun hujjatlari hamda xalqaro shartnomalar tashkil etadi."
  },
  {
    "id": 7,
    "savol": "Huquqni muhofaza qilish tizimini taxlil eting.",
    "javob": "Tizim — jamiyatda qonun ustuvorligini ta’minlovchi davlat organlari majmuidir. Unga sudlar (odil sudlov), prokuratura (nazorat), ichki ishlar (jamoat tartibi), davlat xavfsizligi, adliya, bojxona va soliq organlari kiradi. Tizimning asosiy funksiyasi huquqbuzarliklarning oldini olish, ularni fosh etish va aybdorlarni javobgarlikka tortishdir."
  },
  {
    "id": 8,
    "savol": "Oʻzbekistonda sud hokimiyatining asosiy vazifalari nimalardan iborat?",
    "javob": "Asosiy vazifalar: fuqarolarning Konstitutsiya va qonunlarda mustahkamlangan huquq va erkinliklarini, davlat va jamoat manfaatlarini, yuridik shaxslarning huquqlarini himoya qilish, shuningdek, qonuniylik va adolatni qaror toptirish."
  },
  {
    "id": 9,
    "savol": "Sud hokimiyatining mustaqilligi qanday taʼminlanadi?",
    "javob": "Mustaqillik: sudyalarning daxlsizligi, ularning ishiga har qanday aralashuvning taqiqlanishi va javobgarlikka sabab bo‘lishi, sudyalarni tayinlashning maxsus tartibi, ularning muddatsiz yoki uzoq muddatga saylanishi hamda davlat tomonidan moddiy va ijtimoiy ta’minlanishi orqali kafolatlanadi."
  },
  {
    "id": 10,
    "savol": "Oʻzbekiston Respublikasi sud tizimi qanday bo‘g‘inlardan tashkil topgan?",
    "javob": "Tizim tarkibi: 1) O‘zbekiston Respublikasi Konstitutsiyaviy sudi; 2) O‘zbekiston Respublikasi Oliy sudi; 3) Harbiy sudlar; 4) Qoraqalpog‘iston Respublikasi, viloyatlar va Toshkent shahar sudlari; 5) Tuman (shahar) sudlari (fuqarolik, jinoyat, iqtisodiy va ma’muriy yo‘nalishlar bo‘yicha)."
  },
  {
    "id": 11,
    "savol": "Konstitutsiyaga koʻra sud hokimiyatining boshqa hokimiyat tarmoqlari bilan munosabati.",
    "javob": "O‘zbekiston Konstitutsiyasiga ko‘ra, sud hokimiyati qonun chiqaruvchi va ijro etuvchi hokimiyatlardan mustaqil holda faoliyat yuritadi. Bu 'hokimiyatlarning bo‘linishi' tamoyiliga asoslanib, sud boshqa tarmoqlarning qonun buzilishlarini cheklab turuvchi va huquqiy muvozanatni ta’minlovchi organ hisoblanadi."
  },
  {
    "id": 12,
    "savol": "Sudyalar qanday tartibda tayinlanadi yoki saylanadi?",
    "javob": "Konstitutsiyaviy sud sudyalari Senat tomonidan saylanadi. Oliy sud sudyalari Prezident taqdimnomasiga ko‘ra Senat tomonidan saylanadi. Viloyat, tuman va shahar sudlarining sudyalari Sudyalar oliy kengashi tomonidan tayinlanadi."
  },
  {
    "id": 13,
    "savol": "Sudyalar daxlsizligi deganda nima tushuniladi?",
    "javob": "Sudyalar daxlsizligi — sudya vakolati davrida uning shaxsiy xavfsizligi, turar joyi, foydalanadigan transporti va aloqa vositalari daxlsizligidir. Sudyaga nisbatan jinoiy ish qo‘zg‘atish va uni qamoqqa olish faqat Bosh prokuror tomonidan, Sudyalar oliy kengashi roziligi bilan amalga oshirilishi mumkin."
  },
  {
    "id": 14,
    "savol": "Sud qarorlarini ijro etish kim tomonidan amalga oshiriladi?",
    "javob": "Sud qarorlarini majburiy ijro etish O‘zbekiston Respublikasi Bosh prokuraturasi huzuridagi Majburiy ijro bürosi (MIB) davlat ijrochilari tomonidan amalga oshiriladi."
  },
  {
    "id": 15,
    "savol": "Fuqarolik ishlari bo‘yicha sudlar qaysi masalalarni koʻradi?",
    "javob": "Bu sudlar fuqarolik, oila, mehnat munosabatlariga oid nizolarni, uy-joy va yerga oid masalalarni, shuningdek, alohida tartibda yuritiladigan ishlarni (masalan, shaxsni bedarak yo‘qolgan deb topish) ko‘rib chiqadi."
  },
  {
    "id": 16,
    "savol": "Jinoyat ishlari boʻyicha sudlarning vakolatlari nimalardan iborat?",
    "javob": "Jinoyat ishlari bo‘yicha sudlar shaxsning aybdorligi yoki aybsizligi masalasini hal qiladi, jazo choralarini tayinlaydi, shuningdek, tergov ustidan sud nazoratini (qamoqqa olishga sanksiya berish va b.) amalga oshiradi."
  },
  {
    "id": 17,
    "savol": "Maʼmuriy sudlar qanday vazifalarni bajaradi?",
    "javob": "Ma’muriy sudlar davlat organlarining, mansabdor shaxslarning qarorlari va harakatlari (harakatsizligi) ustidan berilgan shikoyatlarni ko‘rib chiqadi hamda ommaviy-huquqiy munosabatlardan kelib chiqadigan nizolarni hal etadi."
  },
  {
    "id": 18,
    "savol": "Oliy sudning asosiy vakolatlari nimalardan iborat?",
    "javob": "Oliy sud fuqarolik, jinoiy, iqtisodiy va ma’muriy sud ishlarini yuritish sohasida oliy sud hokimiyati organi hisoblanadi. U quyi sudlarning qarorlari ustidan nazorat qiladi va sud amaliyoti bo‘yicha tushuntirishlar (Plenum qarorlari) beradi."
  },
  {
    "id": 19,
    "savol": "Konstitutsiyaviy sud qanday masalalarni hal qiladi?",
    "javob": "Konstitutsiyaviy sud qonunlar, farmonlar va boshqa normativ-huquqiy hujjatlarning Konstitutsiyaga muvofiqligini aniqlaydi, referendum o‘tkazish masalalarini ko‘rib chiqadi va Konstitutsiya normalariga rasmiy sharh beradi."
  },
  {
    "id": 20,
    "savol": "Sud hokimiyatida odil sudlov tamoyillari nimalarni anglatadi?",
    "javob": "Bu tamoyillar sud ishini yuritishning asosiy qoidalaridir: qonun va sud oldida barchaning tengligi, sudyalarning mustaqilligi, sud ishlarining oshkoraligi, aybsizlik prezumpsiyasi va sud ishlarini taraflarning tortishuvi asosida olib borish."
  },
  {
    "id": 21,
    "savol": "Sud hokimiyatining xalq ishonchini oshirishda qanday ahamiyati bor?",
    "javob": "Sud hokimiyati adolatli qarorlar chiqarish orqali qonun ustuvorligini ta’minlaydi. Xalqning sudga bo‘lgan ishonchi davlatning barqarorligini belgilaydi; har bir shaxs o‘z huquqlari sud orqali himoya qilinishiga ishonsa, jamiyatda huquqiy madaniyat yuksaladi va nizolar qonuniy yo‘l bilan hal etiladi."
  },
  {
    "id": 22,
    "savol": "Oʻzbekiston Respublikasi Ichki ishlar organlarining davlat boshqaruvidagi oʻrni va ahamiyati nimada?",
    "javob": "IIO ijro etuvchi hokimiyat tizimiga kiruvchi, jamoat tartibini saqlash, fuqarolar xavfsizligini ta’minlash va jinoyatchilikka qarshi kurashish bo‘yicha ixtisoslashgan huquqni muhofaza qiluvchi organ hisoblanadi. U davlat boshqaruvida qonuniylikni va ichki barqarorlikni ta’minlovchi asosiy kuchdir."
  },
  {
    "id": 23,
    "savol": "Ichki ishlar organlarining asosiy vazifalari va ularning huquqiy asoslari nimalardan iborat?",
    "javob": "Vazifalari: fuqarolar huquqlarini himoya qilish, jamoat tartibini saqlash, jinoyatlarni fosh etish va profilaktika qilish. Huquqiy asoslari: Konstitutsiya, 'Ichki ishlar organlari to‘g‘risida'gi Qonun, Prezident farmon va qarorlari hamda sohaviy normativ hujjatlar."
  },
  {
    "id": 24,
    "savol": "Xavfsizlik organlarining davlat suverenitetini ta’minlashdagi roli qanday namoyon boʻladi?",
    "javob": "Xavfsizlik organlari (DXX) davlatning mustaqilligi, konstitutsiyaviy tuzumi va hududiy yaxlitligiga qarshi tashqi va ichki tahdidlarni aniqlaydi, razvedka va kontrrazvedka faoliyati orqali davlat sirlari va manfaatlarini himoya qiladi."
  },
  {
    "id": 25,
    "savol": "Ichki ishlar organlari faoliyatida qonuniylik, inson huquqlariga hurmat va odillik tamoyillari qanday amalga oshiriladi?",
    "javob": "Ushbu tamoyillar xodimlar tomonidan xizmat vazifalarini bajarishda qonun normalariga qat'iy rioya qilish, ushlangan shaxslarga nisbatan qiynoq va kamsitishlarni taqiqlash, har bir harakatni faqat qonuniy vakolat doirasida amalga oshirish orqali ta’minlanadi."
  },
  {
    "id": 26,
    "savol": "Ichki ishlar va xavfsizlik organlarining oʻzaro hamkorlik mexanizmlari qanday tartibda yoʻlga qoʻyilgan?",
    "javob": "Hamkorlik axborot almashish, qo‘shma operativ-qidiruv tadbirlarini o‘tkazish va terrorizm, uyushgan jinoyatchilik hamda narkotrafikka qarshi kurashish bo‘yicha idoralararo muvofiqlashtiruvchi guruhlar doirasida amalga oshiriladi."
  },
  {
    "id": 27,
    "savol": "Oʻzbekiston Respublikasi Davlat xavfsizlik xizmati (DXX)ning asosiy funksiyalari va vakolatlari nimalardan iborat?",
    "javob": "Funksiyalari: davlat xavfsizligiga tahdidlarni aniqlash, terrorizm va ekstremizmga qarshi kurashish, davlat chegaralarini qo‘riqlash, korrupsiyaga qarshi kurashish va davlat sirlarini muhofaza qilish. Vakolatlari: operativ-qidiruv tadbirlari, tergov o‘tkazish va razvedka faoliyati."
  },
  {
    "id": 28,
    "savol": "Jinoyatchilikka qarshi kurashda ichki ishlar organlarining o‘rni qanday baholanadi?",
    "javob": "IIO jinoyatchilikka qarshi kurashning eng quyi bo‘g‘ini va asosiy ijrochisi hisoblanadi. Ular jinoyatlarni bevosita fosh etish, profilaktika qilish va tergovga qadar tekshiruv o‘tkazish orqali huquqiy tartibotning 'birinchi chizig'ida turadi."
  },
  {
    "id": 29,
    "savol": "Ichki ishlar organlari xodimlarining kasbiy etikasi va intizom tamoyillari qanday belgilangan?",
    "javob": "Xodimlar odob-axloq qoidalari, xizmat intizomi va qasamyodga amal qilishlari shart. Tamoyillar: xushmuomalalik, halollik, xolislik va shaxsiy manfaatdorlikka yo‘l qo‘ymaslik."
  },
  {
    "id": 30,
    "savol": "Xavfsizlik organlarining axborot xavfsizligini taʼminlashdagi roli qanday?",
    "javob": "Ular kiberhujumlarning oldini oladi, maxfiy aloqa tizimlarini himoya qiladi, axborot makonidagi buzg‘unchi g‘oyalar tarqalishiga qarshi kurashadi va muhim infratuzilmalarning kiberxavfsizligini nazorat qiladi."
  },
  {
    "id": 31,
    "savol": "Ichki ishlar organlari faoliyatini nazorat qilish va jamoatchilik bilan hamkorlik qilish shakllari qanday amalga oshiriladi?",
    "javob": "Nazorat idoraviy, prokuror nazorati va parlament nazorati orqali amalga oshiriladi. Jamoatchilik bilan hamkorlik — jamoat kengashlari, mahalla fuqarolar yig‘inlari bilan hamkorlik va OAV orqali hisobot berish shaklida bo‘ladi."
  },
  {
    "id": 32,
    "savol": "Milliy Gvardiya faoliyatining huquqiy asosi bo'lib xizmat qiladigan asosiy normativ-huquqiy hujjat qaysi? U qachon qabul qilingan?",
    "javob": "Asosiy hujjat — 'O‘zbekiston Respublikasi Milliy gvardiyasi to‘g‘risida'gi Qonun bo‘lib, u 2020-yil 18-noyabrda qabul qilingan."
  },
  {
    "id": 33,
    "savol": "'O'zbekiston Respublikasi Milliy Gvardiyasi to'g'risida'gi Qonunda Milliy Gvardiya faoliyatining belgilangan asosiy prinsiplari qaysilardan iborat?",
    "javob": "Prinsiplar: qonuniylik, inson huquqlari va erkinliklariga rioya etish, yagonalik, markazlashtirilgan rahbarlik va maxfiylikka rioya qilish."
  },
  {
    "id": 34,
    "savol": "Milliy Gvardiya o'z faoliyatini amalga oshirishda kimga bevosita bo'ysunadi va hisobdordir?",
    "javob": "Milliy gvardiya bevosita O‘zbekiston Respublikasi Prezidentiga bo‘ysunadi va unga hisobdordir."
  },
  {
    "id": 35,
    "savol": "Milliy Gvardiya harbiy xizmatchilari (xodimlari)ning faoliyatida qonuniylik prinsipi nimani talab qiladi va uni buzish qanday oqibatlarga olib keladi?",
    "javob": "Qonuniylik prinsipi faqat qonun doirasida harakat qilishni talab qiladi. Uni buzish xodim uchun intizomiy, ma’muriy yoki jinoiy javobgarlikka, shuningdek, yetkazilgan zararning qoplanishiga olib keladi."
  },
  {
    "id": 36,
    "savol": "Milliy Gvardiya harbiy xizmatchisining o'z vakolatlari doirasida qo'yilgan qonuniy talablarini bajarish majburiyligi kimlar uchun nazarda tutilgan?",
    "javob": "Barcha fuqarolar, mansabdor shaxslar va yuridik shaxslar uchun majburiydir. Ularni bajarmaslik qonun bilan belgilangan javobgarlikka sabab bo‘ladi."
  },
  {
    "id": 37,
    "savol": "'O'zbekiston Respublikasi Milliy Gvardiyasi to'g'risida'gi Qonunga ko'ra, Milliy Gvardiya o'z vazifalarini bajarishda qaysi subyektlar bilan hamkorlik qilishi belgilangan?",
    "javob": "Davlat organlari, o‘zini o‘zi boshqarish organlari, jamoat birlashmalari va boshqa tashkilotlar, shuningdek, huquqni muhofaza qiluvchi boshqa organlar bilan hamkorlik qiladi."
  },
  {
    "id": 38,
    "savol": "Advokatura tushunchasi va uning jamiyatdagi o‘rni nimadan iborat?",
    "javob": "Advokatura — jismoniy va yuridik shaxslarga professional huquqiy yordam ko‘rsatuvchi mustaqil huquqiy institutdir. U jamiyatda inson huquqlari himoyasini, odil sudlovda tenglik va tortishuvchanlikni ta’minlaydi."
  },
  {
    "id": 39,
    "savol": "Advokatlik faoliyati bilan shug‘ullanish uchun qanday talablar qo‘yiladi?",
    "javob": "Talablar: oliy yuridik ma’lumot, kamida 2 yillik yuridik mutaxassislik bo‘yicha ish staji, advokatlik tuzilmasida stajirovka o‘tash, malaka imtihonini topshirish va advokatlik litsenziyasini olish."
  },
  {
    "id": 40,
    "savol": "Advokatning huquq va majburiyatlarini sanang.",
    "javob": "Huquqlari: dalillar to‘plash, davlat organlaridan ma’lumot so‘rash, mijoz bilan xoli uchrashish. Majburiyatlari: mijoz manfaatini qonuniy yo‘llar bilan himoya qilish, advokatlik sirini saqlash va kasb etikasi qoidalariga rioya etish."
  },
  {
    "id": 41,
    "savol": "Advokatlik siri deganda nimani tushunasiz?",
    "javob": "Advokatlik siri — advokatga mijoz tomonidan huquqiy yordam so‘rab murojaat qilinganligi, yordam mazmuni va maslahat tafsilotlari haqidagi ma’lumotlarning maxfiyligidir. Advokat ushbu ma’lumotlarni oshkor qilishga yoki guvoh sifatida ko‘rsatma berishga haqli emas."
  },
  {
    "id": 42,
    "savol": "Advokatura faoliyatining asosiy prinsiplari nimalardan iborat?",
    "javob": "Asosiy prinsiplar: qonuniylik, advokaturaning mustaqilligi, advokatlik faoliyatining o‘z-o‘zini boshqarishi, advokatlar tengligi, mijoz huquqlari va qonuniy manfaatlarini himoya qilishda insonparvarlik hamda advokatlik sirini saqlash."
  },
  {
    "id": 43,
    "savol": "Notariat tushunchasi va uning asosiy vazifasi nimadan iborat?",
    "javob": "Notariat — qonun bilan belgilangan hollarda yoki taraflar xohishiga ko‘ra huquq va faktlarni tasdiqlash (yuridik jihatdan mustahkamlash) orqali shaxslarning huquqlarini himoya qiluvchi institutdir. Vazifasi: nizolarning oldini olish va huquqiy hujjatlarga qonuniy kuch berishdir."
  },
  {
    "id": 44,
    "savol": "Notarius kim va u qanday vakolatlarga ega?",
    "javob": "Notarius — davlat nomidan notarial harakatlarni amalga oshirish vakolati berilgan maxsus shaxsdir. Vakolatlari: bitimlarni tasdiqlash, merosga bo‘lgan huquq to‘g‘risida guvohnomalar berish, hujjatlar nusxalarining to‘g‘riligini tasdiqlash va ijro xatlarini yozish."
  },
  {
    "id": 45,
    "savol": "Notarial harakatlar deganda nimani tushunasiz?",
    "javob": "Notarial harakatlar — notariuslar yoki qonun bilan vakolat berilgan boshqa mansabdor shaxslar tomonidan amalga oshiriladigan, yuridik ahamiyatga ega bo‘lgan faktlarni tasdiqlashga qaratilgan qonuniy jarayonlardir."
  },
  {
    "id": 46,
    "savol": "Notarius faoliyatida qonuniylik va betaraflik prinsiplari qanday ta’minlanadi?",
    "javob": "Qonuniylik — harakatlarni faqat qonun doirasida bajarish bilan, betaraflik esa notariusning taraflardan birining manfaatini ko‘zlamasligi, barcha ishtirokchilarga tushuntirish berishi va o‘ziga yoki yaqin qarindoshlariga oid ishlarni ko‘rmasligi orqali ta’minlanadi."
  },
  {
    "id": 47,
    "savol": "Notarial harakatni amalga oshirishni rad etish mumkin bo‘lgan holatlar nimalardan iborat?",
    "javob": "Rad etish holatlari: harakat qonunga zid bo‘lsa, hujjatlar qonun talablariga muvofiq bo‘lmasa, murojaat qilgan shaxs muomala layoqatiga ega bo‘lmasa yoki vakolati bo‘lmasa."
  },
  {
    "id": 48,
    "savol": "Notariat idora tushunchasini izohlang.",
    "javob": "Notariat idora — notarius faoliyat yuritadigan, notarial harakatlar amalga oshiriladigan va notarial hujjatlar arxivi saqlanadigan rasmiy joydir. O‘zbekistonda hozirda asosan xususiy amaliyot bilan shug‘ullanuvchi notarial idoralar faoliyat yuritadi."
  },
  {
    "id": 49,
    "savol": "Notariat idoralarning asosiy vazifalari nimalardan iborat?",
    "javob": "Vazifalari: bitimlarning qonuniyligini tekshirish, mulkiy huquqlarni rasmiylashtirish, taraflarga o‘z huquq va majburiyatlarini tushuntirish hamda huquqbuzarliklarning oldini olish uchun yuridik dalillarni mustahkamlash."
  },
  {
    "id": 50,
    "savol": "Notariat idoralar faoliyatining huquqiy asoslarini ko‘rsating.",
    "javob": "Huquqiy asoslar: O‘zbekiston Respublikasi Konstitutsiyasi, 'Notariat to‘g‘risida'gi Qonun, Adliya vazirligi tomonidan tasdiqlangan yo‘riqnomalar va Nizomlar."
  },
  {
    "id": 51,
    "savol": "Notarius kim va uning huquqlari nimalardan iborat?",
    "javob": "Notarius — yuridik ma’lumotga va litsenziyaga ega mutaxassisdir. Huquqlari: notarial harakatlar uchun zarur hujjatlarni so‘rash, loyihalarni tayyorlash, davlat reyestrlaridan ma’lumot olish va ko‘rsatilgan xizmatlar uchun haq olish."
  },
  {
    "id": 52,
    "savol": "Notariat harakat tushunchasini izohlang.",
    "javob": "Bu — notarius tomonidan amalga oshiriladigan har qanday rasmiy harakat bo‘lib, u huquqiy oqibatlar keltirib chiqaradi (masalan, vasiyatnomani tasdiqlash yoki imzo haqiqiyligini shahodatlash)."
  },
  {
    "id": 53,
    "savol": "Notariat idoralarning davlat boshqaruvidagi o‘rni qanday?",
    "javob": "Notariat bevosita davlat boshqaruvi organi bo‘lmasa-da, u fuqarolik muomalasi xavfsizligini ta’minlash orqali davlatning huquqni muhofaza qilish funksiyasini bajaradi va Adliya vazirligi tomonidan nazorat qilinadi."
  },
  {
    "id": 54,
    "savol": "Advokatura tushunchasi va uning jamiyatdagi o‘rni nimalardan iborat?",
    "javob": "Advokatura — nodavlat-notijorat tuzilma bo‘lib, jamiyatda huquqiy himoya kafolati hisoblanadi. U odil sudlovda muvozanatni saqlaydi va fuqarolik jamiyati institutlarining ajralmas qismidir."
  },
  {
    "id": 55,
    "savol": "Advokat kim va uning asosiy vazifalari nimalardan iborat?",
    "javob": "Advokat — professional asosda yuridik yordam ko‘rsatuvchi shaxsdir. Vazifalari: maslahat berish, sudlarda vakillik qilish, himoyani amalga oshirish va huquqiy xizmat ko‘rsatish orqali adolat o‘rnatilishiga ko‘maklashish."
  },
  {
    "id": 56,
    "savol": "O‘zbekiston Respublikasida advokatura faoliyatini tartibga soluvchi asosiy huquqiy hujjatlar qaysilar?",
    "javob": "Asosiy hujjatlar: Konstitutsiya, 'Advokatura to‘g‘risida'gi Qonun, 'Advokatlik faoliyatining kafolatlari va advokatlarning ijtimoiy himoyasi to‘g‘risida'gi Qonun."
  },
  {
    "id": 57,
    "savol": "Advokatlik faoliyatining asosiy prinsiplari nimalardan iborat?",
    "javob": "Bu prinsiplar: qonun ustuvorligi, advokatning mustaqilligi va faqat qonunga bo‘ysunishi, advokatlar o‘rtasidagi kasbiy birodarlik va etika me’yorlariga rioya etish."
  },
  {
    "id": 58,
    "savol": "Advokatlik kasbiga kirish uchun qanday talablar qo‘yiladi?",
    "javob": "Oliy yuridik ma’lumot, kamida 2 yil ish staji, 3 oydan 6 oygacha stajirovka, malaka imtihonini muvaffaqiyatli topshirish va advokat qasamyodini qabul qilish."
  },
  {
    "id": 59,
    "savol": "Advokatlik faoliyatini amalga oshirish uchun litsenziya qanday tartibda beriladi?",
    "javob": "Litsenziya malaka imtihonidan o‘tgan shaxsga hududiy adliya organlari tomonidan beriladi. Shundan so‘ng shaxs 3 oy ichida advokatlik tuzilmasini tuzishi yoki unga a’zo bo‘lishi shart."
  },
  {
    "id": 60,
    "savol": "Bangalor prinsiplariga ko‘ra sudyalar faoliyati va xul-atvoriga oid belgilangan 6 ta muhim qoida haqida aytib bering.",
    "javob": "Bangalor prinsiplari: 1) Mustaqillik; 2) Xolislik; 3) Halollik va sadoqat (Integrity); 4) Odob-axloq (Propriety); 5) Tenglikni ta’minlash; 6) Layoqatlilik va tirishqoqlik."
  },
  {
    "id": 61,
    "savol": "Milliy Gvardiya o'z faoliyatini amalga oshirishda kimga bevosita bo'ysunadi va hisobdordir?",
    "javob": "O‘zbekiston Respublikasi Milliy gvardiyasi bevosita O‘zbekiston Respublikasi Prezidentiga bo‘ysunadi va unga hisobdordir."
  },
  {
    "id": 62,
    "savol": "Yevropa Kengashining CM/Rec12 tavsiyasiga ko‘ra sudyaning javobgarlikka tortilmasligi mazmunini tushuntiring.",
    "javob": "Bu tavsiya 'sudya xatosi' va 'sudya jinoyati'ni ajratadi. Sudya qonunni talqin qilishda adashsa, bu yuqori sud tomonidan tuzatiladi, lekin sudya bu uchun jazolanmaydi. Bu sudyaning qo‘rqmasdan, faqat qonun va ichki ishonchga asoslanib qaror qabul qilishi (mustaqilligi)ni ta’minlash uchun zarur."
  },
  {
    "id": 63,
    "savol": "Advokatura tushunchasi, vazifasi va faoliyat turlari haqida nimalarni bilasiz.",
    "javob": "Advokatura — huquqiy yordam ko‘rsatuvchi mustaqil institut. Vazifasi: huquqlarni himoya qilish va odil sudlovga ko‘maklashish. Turlari: maslahat berish, hujjatlar tayyorlash, sudlarda vakillik qilish va jinoyat ishlarida himoyachi sifatida qatnashish."
  },
  {
    "id": 64,
    "savol": "O‘zbekiston Respublikasida advokatlik faoliyati qaysi normativ-huquqiy hujjatlar bilan tartibga solinadi.",
    "javob": "Asosiy hujjatlar: O‘zbekiston Respublikasi Konstitutsiyasi, 'Advokatura to‘g‘risida'gi Qonun va 'Advokatlik faoliyatining kafolatlari va advokatlarning ijtimoiy himoyasi to‘g‘risida'gi Qonun."
  },
  {
    "id": 65,
    "savol": "Mustaqillikdan so‘ng advokatura institutida ijobiy o‘zgarishlarga sabab bo‘lgan hujjatlar.",
    "javob": "1996-yildagi 'Advokatura to‘g‘risida'gi Qonun, 2008-yildagi 'Advokatura institutini takomillashtirish to‘g‘risida'gi Prezident Farmoni (Advokatlar palatasi tashkil etilishi) va 2018-yildagi tub islohotlarga oid Farmonlar."
  },
  {
    "id": 66,
    "savol": "O‘zbekiston Respublikasida advokat sifatida faoliyat yuritish uchun belgilangan talablar.",
    "javob": "Oliy yuridik ma’lumot, kamida ikki yillik yuridik staj, stajirovka o‘tash, malaka imtihonini topshirish, qasamyod qilish va litsenziya olish."
  },
  {
    "id": 67,
    "savol": "Advokatning boshqa haq to‘lanadigan ish bilan shug‘ullanishi taqiqlanishining sababi nimada?",
    "javob": "Asosiy sabab — advokatning mustaqilligini saqlash va manfaatlar to‘qnashuvining oldini olish. Shuningdek, advokat butun e’tiborini himoya funksiyasiga qaratishi va boshqa xizmat pog‘onalariga (masalan, davlat xizmatiga) bog‘lanib qolmasligi kerak."
  },
  {
    "id": 68,
    "savol": "So‘ngi yillarda advokatlarning mustaqilligini ta’minlash uchun amalga oshirilgan ishlar.",
    "javob": "Advokat maqomi sudya maqomiga yaqinlashtirildi, tintuv o‘tkazish va telefon so‘zlashuvlarini eshitish faqat sud qarori bilan belgilandi, 'E-advokat' tizimi joriy etildi va iqtisodiy ishlarda advokat ishtiroki kengaytirildi."
  },
  {
    "id": 69,
    "savol": "Advokatlik faoliyatining tashkiliy shakllari va ularning farqi.",
    "javob": "Shakllari: Advokatlik bürosi (yakka tartibda), Advokatlik hay’ati (jamoaviy) va Advokatlik firmasi (sherikchilik). Farqi — ta’sischilar soni va mulkiy javobgarlik darajasida."
  },
  {
    "id": 70,
    "savol": "Advokat oldiga qo‘yilgan asosiy vazifalar.",
    "javob": "Mijozning huquqlarini qonuniy vositalar bilan himoya qilish, professional sirni saqlash, sud jarayonida xolislikni ta’minlash va jamiyatda huquqiy ongni yuksaltirish."
  },
  {
    "id": 71,
    "savol": "Eng qulay advokatlik faoliyati shakli va asosi.",
    "javob": "Javob subyektiv: Advokatlik bürosi (yakka tartibda) qaror qabul qilishda mustaqillik beradi. Advokatlik hay’ati esa jamoaviy tajriba almashish va xarajatlarni taqsimlash uchun qulay. Odatda, yangi boshlovchilar uchun hay’at, tajribalilar uchun büro qulay hisoblanadi."
  },
  {
    "id": 72,
    "savol": "Notariat institutining fuqarolik huquq va burchlarini belgilashdagi roli.",
    "javob": "Notariat bitimlarni tasdiqlash orqali ularga huquqiy aniqlik beradi. Bu shaxslarning irodasi erkinligini tekshiradi, kelajakdagi nizolarning oldini oladi va bitimning qonuniyligiga davlat nomidan kafolat beradi."
  },
  {
    "id": 73,
    "savol": "Notarial harakatlarda foydalaniladigan texnika vositalari.",
    "javob": "Asosiy vositalar: 'Nodavlat notariat' axborot tizimi, barmoq izi skanerlari (biometrika), video-fiksatsiya qurilmalari, elektron raqamli imzo va maxsus himoyalangan blankalar."
  },
  {
    "id": 74,
    "savol": "So‘ngi yillarda notariat faoliyatini takomillashtirishdagi o‘zgarishlar.",
    "javob": "Xususiy notariuslar institutining qayta tiklanishi, 'yagona darcha' tamoyili, masofaviy notarial harakatlarning joriy etilishi va ko‘plab majburiy notarial tasdiqlashlarning bekor qilinishi (soddalashtirish)."
  },
  {
    "id": 75,
    "savol": "Kvazisud tashkilotlarining davlat sudlari bilan o‘xshash va farqli tomonlari.",
    "javob": "O‘xshashlik: nizoni hal qiladi va qaror chiqaradi. Farqi: kvazisudlar (hakamlik sudi, mediatsiya) ixtiyoriylikka asoslanadi, jarayon yopiq o‘tishi mumkin, hakamlarni taraflar tanlaydi. Davlat sudi esa majburiy yurisdiksiyaga ega."
  },
  {
    "id": 76,
    "savol": "Respublikamizda kvazisud tashkilotlarining nizolarni hal etishdagi roli.",
    "javob": "Ular davlat sudlari ish yuklamasini kamaytiradi, nizolarni tezroq va arzonroq hal qiladi hamda biznes subyektlari o‘rtasidagi hamkorlik aloqalarini saqlab qolishga yordam beradi."
  },
  {
    "id": 77,
    "savol": "Doimiy faoliyat yurituvchi hakamlik sudlari faoliyatiga izoh.",
    "javob": "Bu sudlar yuridik shaxslar (masalan, Savdo-sanoat palatasi) huzurida doimiy tashkil etiladi. Ularning o‘z binosi, reglamenti va sudyalar ro‘yxati mavjud bo‘lib, taraflar kelishuvi asosida ishlarni ko‘radi."
  },
  {
    "id": 78,
    "savol": "Hakamlik sudining nizomi hamda reglamenti nimalarni qamrab oladi.",
    "javob": "Nizom sudning tashkiliy tuzilishini, reglament esa ishni ko‘rish tartibini (da’vo berish, muddatlar, dalillar keltirish va qaror chiqarish jarayoni) belgilaydi."
  },
  {
    "id": 79,
    "savol": "«Hakamlik sudlari to‘g‘risida» gi qonun yaratgan qulayliklar.",
    "javob": "Nizolarni sudgacha hal qilish imkoniyati, xarajatlarning kamligi, qarorning yakuniyligi va uni majburiy ijro etishning huquqiy mexanizmi yaratilganligi."
  },
  {
    "id": 80,
    "savol": "Nizolarni hal etishda mediatsiya usuli afzalliklari.",
    "javob": "Afzalliklari: konfidensiallik (maxfiylik), 'yutuq-yutuq' (har ikki taraf roziligi) tamoyili, vaqtni tejash, jarayonning norasmiyligi va taraflar o‘rtasidagi insoniy munosabatlarning saqlanishi."
  },
  {
    "id": 81,
    "savol": "Mediatsiyaning asosiy belgilari nimalardan iborat ekanligini tushuntirib bering.",
    "javob": "Mediatsiyaning asosiy belgilari: ixtiyoriylik (taraflarning xohishi), maxfiylik (jarayon sirliligi), mediatorning xolisligi va betarafligi, taraflarning teng huquqliligi va mustaqilligidir."
  },
  {
    "id": 82,
    "savol": "“Mediatsiya to‘g‘risida”gi Qonun ishlashini ta’minlash uchun amalga oshirilgan o‘zgarishlar.",
    "javob": "Fuqarolik va Iqtisodiy protsessual kodekslarga mediatsiya kelishuvi tuzilganda davlat bojini qaytarish, sud jarayonini to‘xtatib turish hamda ijro varaqasi berish tartiblari kiritildi."
  },
  {
    "id": 83,
    "savol": "Mediatsiya instituti muvaffaqiyatli faoliyat yuritayotgan biror davlat misolida.",
    "javob": "Singapur. Bu davlatda 'Multi-door Courthouse' tizimi orqali nizolarning katta qismi sudgacha mediatsiya orqali hal etiladi. Singapur konvensiyasi (2019) mediatsiya kelishuvlarining xalqaro tan olinishini ta'minlaydi."
  },
  {
    "id": 84,
    "savol": "Mediatsiya markazi va Nizolarni muqobil usulda hal etish markazining asosiy vazifalari.",
    "javob": "Vazifalar: professional mediatorlar tayyorlash, nizolarni sudga bormasdan hal etish uchun maydon yaratish, mediatsiya tartib-taomillarini tashkil etish va jamiyatda murosasozlik madaniyatini targ‘ib qilish."
  },
  {
    "id": 85,
    "savol": "Kvazisud tashkilotlari faoliyatini takomillashtirish uchun qanday o‘zgarishlar lozim.",
    "javob": "Hakamlik sudlari qarorlarining majburiy ijro etish mexanizmini soddalashtirish, onlayn-mediatsiya platformalarini huquqiy mustahkamlash va soha mutaxassislari uchun majburiy malaka oshirish tizimini joriy etish lozim."
  },
  {
    "id": 86,
    "savol": "Korrupsiyaning davlat rivojiga to‘siq bo‘lish sabablari.",
    "javob": "Korrupsiya sog‘lom raqobatni bo‘g‘adi, xorijiy investitsiyalar oqimini kamaytiradi, davlat byudjeti mablag‘larini samarasiz sarflanishiga olib keladi va ijtimoiy adolatsizlikni keltirib chiqarib, xalqning davlatga ishonchini so‘ndiradi."
  },
  {
    "id": 87,
    "savol": "O‘zbekistonda korrupsiyaga qarshi kurash sohasida so‘nggi yillarda amalga oshirilgan ishlar.",
    "javob": "Korrupsiyaga qarshi kurashish agentligi tashkil etildi, 'E-Anticor' tizimi ishga tushirildi, davlat xizmatchilari daromadlarini deklaratsiya qilish bosqichma-bosqich joriy etilmoqda va barcha sohalar raqamlashtirilmoqda."
  },
  {
    "id": 88,
    "savol": "Korrupsiyaga qarshi kurashda yutuqlarga erishgan davlat va uning usullari.",
    "javob": "Daniya. Usullari: davlat boshqaruvining yuqori darajadagi shaffofligi, amaldorlarning hisobdorligi, 'ochiq hukumat' ma'lumotlari va jamiyatda korrupsiyaga nisbatan 'nol toqat' (zero tolerance) madaniyati shakllanganligi."
  },
  {
    "id": 89,
    "savol": "Korrupsiyaga qarshi kurash vazifalarining bir davlat organi qo‘lida to‘planishi samaradorligi.",
    "javob": "Bu samarali, chunki bu yagona strategiyani amalga oshirish, resurslarni markazlashtirish va turli idoralar o‘rtasidagi byurokratiyani kamaytirish imkonini beradi (masalan, Singapur yoki Gonkong tajribasi)."
  },
  {
    "id": 90,
    "savol": "Mahalliy davlat hokimiyati idoralarida korrupsiya ko‘p bo‘lishining asosiy sababi.",
    "javob": "Asosiy sabablar: yer ajratish, ruxsatnoma berish kabi resurslar ustidan nazoratning kuchliligi, mahalliy darajada jamoatchilik nazoratining sustligi va qaror qabul qilishda shaffoflikning yetishmasligi."
  },
  {
    "id": 91,
    "savol": "Nepotizm illati haqida nimalarni bilasiz.",
    "javob": "Nepotizm — mansabdor shaxsning o‘z xizmat vakolatlaridan foydalanib, qarindosh-urug‘larini yoki yaqinlarini ishga joylashtirishi yoki ularga imtiyozlar berishi. Bu malakasiz kadrlar ko‘payishiga va meritokratiya (loyiqlik) tamoyili buzilishiga olib keladi."
  },
  {
    "id": 92,
    "savol": "Gruziyaning korrupsiyaga qarshi kurashdagi yutug‘ining asosiy sababi.",
    "javob": "Sababi: 'Radikal islohotlar' (masalan, politsiya tizimining to‘liq yangilanishi), ma’muriy to‘siqlarning keskin qisqartirilishi, davlat xizmatlarini ko‘rsatishda inson omilini yo‘qotish va qat’iy siyosiy iroda."
  },
  {
    "id": 93,
    "savol": "Korrupsiyaga qarshi kurash agentligining asosiy vazifalari.",
    "javob": "Vazifalar: korrupsiyaga qarshi kurash davlat siyosatini shakllantirish, sohadagi loyihalarni tahlil qilish, korrupsiyaviy xavf-xatarlarni baholash va xalqaro hamkorlikni amalga oshirish."
  },
  {
    "id": 94,
    "savol": "Korrupsiyaga qarshi kurashish agentligi faoliyat yo‘nalishlari va vakolatlari.",
    "javob": "Yo‘nalishlar: preventiv (oldini olish) choralar, monitoring va tahlil. Vakolatlari: davlat xaridlarini to‘xtatib turish, so‘rovnomalar yuborish, korrupsiyaga oid faktlar bo‘yicha tekshiruvlar tashabbusi bilan chiqish."
  },
  {
    "id": 95,
    "savol": "Korrupsiyaga qarshi kurashish agentligining huquq va majburiyatlari.",
    "javob": "Huquqlari: hujjatlarni talab qilish, ma’lumotlar bazasidan foydalanish. Majburiyatlari: qonuniylikka rioya etish, fuqarolar murojaatlarini ko‘rib chiqish va har yili Prezident hamda Oliy Majlisga hisobot berish."
  },
  {
    "id": 96,
    "savol": "Korrupsiyaga qarshi kurashish agentligida xizmatni o‘tash tartibi va shartlari.",
    "javob": "Xizmatga qabul qilish ochiq tanlov asosida amalga oshiriladi. Nomzodlar yuksak ma’naviy-axloqiy fazilatlarga va professional malakaga ega bo‘lishi, shuningdek, maxsus tekshiruvdan o‘tishlari shart."
  },
  {
    "id": 97,
    "savol": "Davlat Bojxona qo‘mitasining vazifalari, funksiyalari va huquqlari.",
    "javob": "Vazifasi: iqtisodiy xavfsizlikni ta’minlash, bojxona to‘lovlarini undirish va kontrabandaga qarshi kurashish. Huquqlari: yuklarni ko‘zdan kechirish, transportlarni to‘xtatish, bojxona qoidabuzarliklari bo‘yicha surishtiruv o‘tkazish."
  },
  {
    "id": 98,
    "savol": "Bojxona organlarining boshqa subyektlar bilan hamkorligi.",
    "javob": "Hamkorlik axborot almashish, bojxona chegarasida qo‘shma nazorat tadbirlarini o‘tkazish va tadbirkorlar uchun 'shaffof bojxona' tamoyili asosida maslahat yordamini ko‘rsatish orqali amalga oshiriladi."
  },
  {
    "id": 99,
    "savol": "Bojxona xodimlari tomonidan kuch, maxsus vosita va qurol qo‘llash tartibi.",
    "javob": "Faqat qonunda belgilangan hollarda (hujum bo‘lganda, qochishga uringanda) qo‘llaniladi. Qo‘llashdan oldin ogohlantirish shart (kechiktirib bo‘lmaydigan hollar mustasno) va zarurat chegarasidan chiqilmasligi lozim."
  },
  {
    "id": 100,
    "savol": "Bojxona organlarida xizmatga qabul qilish va xizmatni o‘tash tartibi.",
    "javob": "Xizmatga 18 yoshdan 30 yoshgacha bo‘lgan, oliy ma’lumotli, sog‘lig‘i xizmatga yaroqli fuqarolar tanlov asosida qabul qilinadi. Xodimlar maxsus unvonlarga ega bo‘ladi va harbiy intizom asosida xizmat qiladi."
  },
  {
    "id": 101,
    "savol": "Bojxona organlarining xodimi bo‘lish uchun qo‘yilgan talablarni aytib bering.",
    "javob": "Bojxona xodimi bo'lish uchun O'zbekiston fuqarosi bo'lish, 18 yoshdan kichik va 30 yoshdan katta bo'lmaslik (ayrim hollar mustasno), oliy ma'lumotga ega bo'lish, sog'lig'i xizmatga yaroqli bo'lishi va maxsus tekshiruvdan o'tish talab etiladi."
  },
  {
    "id": 102,
    "savol": "Bojxona organlari xodimlarini huquqiy va ijtimoiy himoya qilish haqida nimalarni bilasiz.",
    "javob": "Xodimlar davlat himoyasida bo'lib, ularning hayoti va sog'lig'i majburiy sug'urta qilinadi. Ular bepul tibbiy xizmat, uy-joy ijarasi uchun kompensatsiya, imtiyozli pensiya ta'minoti va xizmat vazifasini bajarish bilan bog'liq xavf tug'ilganda shaxsiy xavfsizlik kafolatlari bilan ta'minlanadi."
  },
  {
    "id": 103,
    "savol": "Soliq nazorati deganda nimani tushunasiz.",
    "javob": "Soliq nazorati — davlat soliq xizmati organlari tomonidan soliq to'lovchilarning soliq to'g'risidagi qonunchilikka rioya etishini, soliqlarning to'g'ri hisoblanishi va o'z vaqtida to'lanishini tekshirishga qaratilgan tadbirlar majmuidir."
  },
  {
    "id": 104,
    "savol": "Davlat soliq xizmati organlarining asosiy vazifalari nimalardan iborat ekanligini tushuntirib bering.",
    "javob": "Vazifalari: soliq qonunchiligiga rioya etilishini nazorat qilish, soliq to'lovchilar hisobini yuritish, soliqlarni to'liq undirish orqali byudjet daromadlarini ta'minlash va soliq to'lovchilarga xizmat ko'rsatish (maslahat va tushuntirish berish)."
  },
  {
    "id": 105,
    "savol": "Davlat soliq xizmati organlarining boshqa organlar bilan o‘zaro hamkorligi shakllarini tushuntiring.",
    "javob": "Hamkorlik axborot almashish (masalan, banklar bilan hisob raqamlar bo'yicha), prokuratura va IIB bilan soliqqa oid jinoyatlarni fosh etishda qo'shma tadbirlar o'tkazish hamda bojxona organlari bilan eksport-import operatsiyalari monitoringini yuritish shaklida amalga oshiriladi."
  },
  {
    "id": 106,
    "savol": "Davlat soliq xizmati organlarining mansabdor shaxslarini tayinlash tartibini tushuntirib bering.",
    "javob": "Soliq qo'mitasi raisi Prezident tomonidan tayinlanadi. Hududiy boshqarma va tuman (shahar) soliq inspeksiyalari rahbarlari yuqori turuvchi organlar tomonidan qonun hujjatlarida belgilangan kvota va malaka talablari asosida tayinlanadi."
  },
  {
    "id": 107,
    "savol": "Davlat soliq xizmati organlari mansabdor shaxslarining javobgarligini keltirib chiqaradigan holatlarni aytib bering.",
    "javob": "Xizmat vakolatini suiiste'mol qilish, soliq siri deb hisoblangan ma'lumotlarni oshkor etish, asossiz ravishda tadbirkorlik faoliyatiga aralashish va soliq to'lovchilarga noqonuniy talablar qo'yish intizomiy, ma'muriy yoki jinoiy javobgarlikka sabab bo'ladi."
  },
  {
    "id": 108,
    "savol": "Jinoyatlarni aniqlash, surishtirish va tergov qilish tushunchasiga izoh bering.",
    "javob": "Bu jarayonlar jinoyatni fosh etish bosqichlaridir: aniqlash — axborot olish; surishtirish — soddalashtirilgan tartibda isbotlash; tergov — jinoyat ishi bo'yicha barcha holatlarni har tomonlama, to'liq va xolis aniqlashga qaratilgan protsessual faoliyatdir."
  },
  {
    "id": 109,
    "savol": "Jinoyat ishini qo‘zg‘atish bosqichlari haqida.",
    "javob": "Bosqichlar: jinoyat haqida ariza yoki xabar olish, ularni ro'yxatga olish, tergovga qadar tekshiruv o'tkazish (10 kun ichida) va natija bo'yicha qaror (ish qo'zg'atish yoki rad etish) qabul qilish."
  },
  {
    "id": 110,
    "savol": "Jinoyat ishini qo‘zg‘atishni dastlabki tergovning bir qismi sifatida qarashga urinayotgan olimlarning fikriga qo‘shilasizmi?",
    "javob": "Mening taxminimcha, bu mantiqiy, chunki ish qo'zg'atish — tergov harakatlarining huquqiy asosi bo'lib, tergov boshlanishini belgilab beradi. Biroq, qonunchilikda bu alohida, mustaqil bosqich hisoblanadi."
  },
  {
    "id": 111,
    "savol": "Dastlabki tergov oldida turgan vazifalar nimalardan iborat deb hisoblaysiz.",
    "javob": "Vazifalar: jinoyat sodir etgan shaxsni aniqlash, aybini isbotlash, keltirilgan zararni qoplash choralarini ko'rish, jinoyat sabablarini aniqlash va asossiz ravishda hech bir shaxs javobgarlikka tortilmasligini ta'minlash."
  },
  {
    "id": 112,
    "savol": "Dastlabki tergov organlari ayblanuvchini jinoiy javobgarlikdan ozod qilishi asoslari.",
    "javob": "Asoslar: shaxsning qilmishiga chin ko'ngildan pushaymon bo'lishi, jabrlanuvchi bilan yarashishi, keltirilgan zararning to'liq qoplanishi yoki javobgarlikka tortish muddati o'tganligi."
  },
  {
    "id": 113,
    "savol": "Surishtiruv organlari tushunchasi, vazifalari va turlarini aytib bering.",
    "javob": "Surishtiruv organlari (IIB, Bojxona, DXX, MIB va b.) jinoyat belgilarini aniqlash va kechiktirib bo'lmaydigan tergov harakatlarini o'tkazish bilan shug'ullanadi. Turlari: vakolatlari doirasiga ko'ra ixtisoslashgan idoralar."
  },
  {
    "id": 114,
    "savol": "Amaldagi jinoyat-prosessual qonunchiligida surishtiruvning vazifalarini tushuntiring.",
    "javob": "Vazifalari: jinoyat ishi bo'yicha dalillarni to'plash, gumon qilinuvchini ushlash va ishning keyingi tergov bosqichiga o'tkazilishi uchun zarur bo'lgan barcha ashyoviy dalillarni mustahkamlash."
  },
  {
    "id": 115,
    "savol": "Tezkor-qidiruv faoliyatini surishtiruvning ish yurituvi deb qaralmasligi sabablarini izohlang.",
    "javob": "Sababi — tezkor-qidiruv faoliyati (TQF) maxfiy usullar bilan amalga oshiriladi va u JPK bilan emas, maxsus 'TQF to'g'risida'gi qonun bilan tartiblanadi. TQF natijalari faqat JPK talablariga muvofiq rasmiylashtirilgachgina dalil bo'ladi."
  },
  {
    "id": 116,
    "savol": "Surishtiruvchi ishni darhol tergovchiga o‘tkazishi lozim bo‘lgan holatlar.",
    "javob": "Agar jinoyat bo'yicha dastlabki tergov o'tkazilishi majburiy bo'lsa yoki surishtiruv jarayonida jinoyat og'irroq turkumga kirishi aniqlansa, ish darhol tergovchiga o'tkaziladi."
  },
  {
    "id": 117,
    "savol": "Dastlabki tergov organlari tushunchasi, vazifalari va turlari haqida.",
    "javob": "Dastlabki tergov — ishni sudga yuborishdan oldingi asosiy bosqichdir. Turlari: Prokuratura, Ichki ishlar va Davlat xavfsizlik xizmati tergov bo'linmalari."
  },
  {
    "id": 118,
    "savol": "Jamiyatda huquqiy madaniyatni yuksaltirishda adliya organlarining roliga baho bering.",
    "javob": "Adliya organlari huquqiy targ'ibotning asosiy muvofiqlashtiruvchisidir. Ular qonun hujjatlarini xalqqa sodda tilda tushuntirish va huquqiy savodxonlikni oshirish orqali huquqbuzarliklar profilaktikasiga katta hissa qo'shadi."
  },
  {
    "id": 119,
    "savol": "Adliya organlari va muassasalari tizimi haqida.",
    "javob": "Tizimga: Adliya vazirligi, hududiy boshqarmalar, Notariat, FHDY, Yuridik xizmat ko'rsatish markazlari, Advokatlar palatasi (nazorat jihatidan) va intellektual mulk agentligi kiradi."
  },
  {
    "id": 120,
    "savol": "Davlat xizmatlari agentligining vazifalari va yaratgan qulayliklari.",
    "javob": "Vazifasi: davlat xizmatlarini 'yagona darcha' orqali ko'rsatish. Qulayliklar: byurokratiyaning kamayishi, vaqtni tejash, elektron murojaat qilish imkoniyati va davlat organlari bilan bevosita muloqotning minimallashishi."
  },
  {
    "id": 121,
    "savol": "Intellektual mulk agentligi faoliyatining asosiy yo‘nalishlari nimalardan iborat deb o‘ylaysiz.",
    "javob": "Asosiy yo‘nalishlar: ixtirolar, tovar belgilari va mualliflik huquqi ob’yektlarini davlat ro‘yxatidan o‘tkazish, intellektual mulk egalarining huquqlarini himoya qilish, kontrafakt mahsulotlarga qarshi kurashish hamda sohada xalqaro hamkorlikni rivojlantirish."
  },
  {
    "id": 122,
    "savol": "“Fuqarolar emas, hujjatlar harakatlanadi” tamoyilining mazmuni va mexanizmi.",
    "javob": "Mazmuni: fuqaro davlat xizmatidan foydalanishda turli idoralardan ma’lumotnoma yig‘ib yurmasligi kerak. Mexanizm: idoralararo elektron hamkorlik tizimi orqali kerakli hujjatlar (diplom, kadastr, FHDY ma'lumotlari)ni davlat organining o‘zi bazadan mustaqil oladi."
  },
  {
    "id": 123,
    "savol": "Respublika sud ekspertiza markazining vazifalari va huquqni muhofaza qilishdagi o‘rni.",
    "javob": "Vazifasi: sud va tergov organlari topshirig‘iga ko‘ra sud ekspertizalarini o‘tkazish va ilmiy tadqiqotlar qilish. O‘rni: ashyoviy dalillarni ilmiy asosda tadqiq etish orqali jinoyatni fosh etish va adolatli sud qarori chiqarilishiga xizmat qiladi."
  },
  {
    "id": 124,
    "savol": "X. Sulaymonova nomidagi Respublika sud ekspertizasi markaziga berilgan huquqlar.",
    "javob": "Huquqlari: ekspertiza uchun zarur materiallar va ish hujjatlari bilan tanishish, qo‘shimcha materiallar so‘rash, yangi ekspertiza usullarini ishlab chiqish va xalqaro sud-ekspertlik tashkilotlari bilan hamkorlik qilish."
  },
  {
    "id": 125,
    "savol": "X. Sulaymonova nomidagi Respublika sud ekspertizasi markazining tuzilishi.",
    "javob": "Markaz markaziy apparat, laboratoriyalar (kriminalistik, kimyoviy, biologik, iqtisodiy va h.k.) hamda hududiy bo‘limlardan tashkil topgan. Shuningdek, uning qoshida ilmiy-tadqiqot va malaka oshirish tuzilmalari mavjud."
  },
  {
    "id": 126,
    "savol": "Adliya vazirligi tizimidagi ta’lim va ilmiy-tadqiqot muassasalari faoliyati.",
    "javob": "Tizimga Toshkent davlat yuridik universiteti (TDYU), yuridik texnikumlar va Huquqiy siyosat tadqiqot instituti kiradi. Ular yuqori malakali kadrlar tayyorlash va qonunchilikni takomillashtirish bo‘yicha ilmiy takliflar ishlab chiqish bilan shug‘ullanadi."
  },
  {
    "id": 127,
    "savol": "Shaxs, jamoat va davlat xavfsizligini ta’minlashning huquqiy asoslari.",
    "javob": "Huquqiy asoslar: Konstitutsiya, 'Milliy xavfsizlik to‘g‘risida'gi konsepsiya, 'Mudofaa to‘g‘risida', 'Ichki ishlar organlari to‘g‘risida' va 'Davlat xavfsizlik xizmati to‘g‘risida'gi qonunlar majmuidir."
  },
  {
    "id": 128,
    "savol": "O‘zbekiston Respublikasi IIVning tashkil etilishi va faoliyat prinsiplari.",
    "javob": "IIV ijro etuvchi hokimiyat organi sifatida jamoat tartibini saqlash uchun tuzilgan. Prinsiplari: qonuniylik, yagonalik, inson huquqlariga rioya etish, ochiqlik va shaffoflik."
  },
  {
    "id": 129,
    "savol": "Ichki ishlar organlarining o‘z faoliyatida ochiqlik va shaffoflik prinsiplariga amal qilishi.",
    "javob": "Mening taxminimcha, so‘nggi yillarda ochiqlik darajasi oshgan (bodikamera, ijtimoiy tarmoqlardagi hisobotlar). Biroq, xizmat siriga oid ma'lumotlar yopiqligicha qoladi. To‘liq shaffoflik uchun jamoatchilik nazorati mexanizmlari hali ham takomillashmoqda."
  },
  {
    "id": 130,
    "savol": "Ichki ishlar organlarining tizimi iyerarxiyasi.",
    "javob": "Iyerarxiya: 1. IIV (markaz); 2. IIBB va IIB (hududiy/viloyat); 3. Tuman (shahar) IIB (quyi bo‘g‘in). Barcha quyi bo‘linmalar yuqori turuvchi organlarga qat'iy bo‘ysunadi."
  },
  {
    "id": 131,
    "savol": "Ichki ishlar xodimlarini tayinlash tartibi.",
    "javob": "Vazir Prezident tomonidan tayinlanadi. Xodimlar oliy ma'lumot va maxsus tayyorgarlikdan so‘ng tanlov va shartnoma asosida xizmatga qabul qilinadi. Lavozimga tayinlash yuqori turuvchi boshliqning buyrug‘i bilan amalga oshiriladi."
  },
  {
    "id": 132,
    "savol": "Ichki ishlar organlarining vazifalari va huquqlari.",
    "javob": "Vazifasi: huquqbuzarliklar profilaktikasi, jinoyatlarni fosh etish, yo‘l harakati xavfsizligi. Huquqlari: hujjatlarni tekshirish, ushlab turish, qurol va maxsus vositalarni qo‘llash, tergovga qadar tekshiruv o‘tkazish."
  },
  {
    "id": 133,
    "savol": "Davlat xavfsizlik xizmatining asosiy vazifalari.",
    "javob": "Vazifalar: davlat chegarasini qo‘riqlash, konstitutsiyaviy tuzumni himoya qilish, razvedka va kontrrazvedka, terrorizm, ekstremizm hamda uyushgan jinoyatchilikka qarshi kurashish."
  },
  {
    "id": 134,
    "savol": "DXX faoliyatidagi 'fuqarolarning yordamiga tayanish' prinsipining izohi.",
    "javob": "Bu prinsip milliy xavfsizlikni ta'minlashda maxfiy va oshkora hamkorlikni anglatadi. DXX fuqarolarning vatanparvarlik hissi va bergan tezkor ma'lumotlariga tayanib, yuz berishi mumkin bo‘lgan xavflarni oldindan bartaraf etadi."
  },
  {
    "id": 135,
    "savol": "Davlat xavfsizlik organlarining vazifalari va huquqlari.",
    "javob": "Vazifasi: milliy manfaatlarni tashqi va ichki tahdidlardan himoya qilish. Huquqlari: operativ-qidiruv tadbirlarini o‘tkazish, qurol qo‘llash, davlat organlaridan maxfiy ma'lumotlarni olish va tergov yuritish."
  },
  {
    "id": 136,
    "savol": "Davlat xavfsizlik xizmati huquqiy maqomi va yo‘nalishlari.",
    "javob": "Maqomi: Prezidentga bo‘ysunuvchi maxsus vakolatli davlat organi. Yo‘nalishlari: iqtisodiy xavfsizlik, axborot xavfsizligi, korrupsiyaga qarshi kurash va harbiy kontrrazvedka."
  },
  {
    "id": 137,
    "savol": "DXX mansabdor shaxslarini tayinlash va ozod etish tartibi.",
    "javob": "DXX raisi Prezident tomonidan tayinlanadi va lavozimidan ozod etiladi. Hududiy boshqarma rahbarlari DXX raisi tomonidan Prezident bilan kelishilgan holda tayinlanadi."
  },
  {
    "id": 138,
    "savol": "O‘zbekiston Respublikasi Milliy Gvardiyasini tuzishdan asosiy maqsad.",
    "javob": "Maqsad: jamoat xavfsizligini ta'minlash tizimini yanada takomillashtirish, muhim davlat ob’yektlarini qo‘riqlash samaradorligini oshirish va ichki barqarorlikni saqlash bo‘yicha tezkor kuch yaratish."
  },
  {
    "id": 139,
    "savol": "O‘zbekiston Respublikasi Milliy Gvardiyasining tuzilish tarixi.",
    "javob": "Milliy gvardiya dastlab 1992-yilda tuzilgan, biroq uzoq vaqt Mudofaa vazirligi tarkibida bo‘lgan. 2017-yilda mustaqil huquqni muhofaza qiluvchi organ sifatida qayta tashkil etildi va unga keng vakolatlar berildi."
  },
  {
    "id": 140,
    "savol": "Milliy gvardiyaning asosiy vazifasi va ahamiyati.",
    "javob": "Vazifasi: ommaviy tadbirlarda xavfsizlikni ta'minlash, ob’yektlarni qo‘riqlash, qurol-yarog‘ aylanishini nazorat qilish va IIOga ko‘maklashish. Ahamiyati: harbiylashtirilgan intizom va politsiya funksiyalarini birlashtirib, tartibni saqlashda tezkorlikni ta'minlaydi."
  },
  {
    "id": 141,
    "savol": "O‘zbekiston Respublikasi Milliy Gvardiyasi vakolatlari va faoliyatining asosiy yo‘nalishlari nimalardan iborat?",
    "javob": "Vakolatlari: jamoat tartibini saqlash, muhim davlat ob’yektlarini qo‘riqlash, qurol-yarog‘ aylanishini nazorat qilish, xususiy qo‘riqlash faoliyatini litsenziyalash va terrorizmga qarshi kurashish. Yo‘nalishlari: huquqbuzarliklar profilaktikasi, fuqarolar xavfsizligini ta'minlash va qo‘riqlash xizmati samaradorligini oshirish."
  },
  {
    "id": 142,
    "savol": "Milliy gvardiya tarkibi va bo‘ysunuvi.",
    "javob": "Tarkibi: Markaziy apparat, hududiy boshqarmalar, harbiy qismlar, ta’lim va tibbiyot muassasalari hamda Qo‘riqlash bosh boshqarmasidan iborat. Bo‘ysunuvi: Milliy gvardiya bevosita O‘zbekiston Respublikasi Prezidentiga bo‘ysunadi va unga hisobdordir."
  },
  {
    "id": 143,
    "savol": "Milliy gvardiyada harbiy xizmatni o‘tash tartibi va shartlari.",
    "javob": "Xizmat 'Umumiy harbiy majburiyat va harbiy xizmat to‘g‘risida'gi Qonun asosida o‘taladi. Nomzodlar 18 yoshga to‘lgan, sog‘lig‘i yaroqli, maxsus tayyorgarlikdan o‘tgan va qasamyod qilgan bo‘lishi shart. Xizmat kontrakt (shartnoma) yoki muddatli harbiy xizmat shaklida bo‘lishi mumkin."
  },
  {
    "id": 144,
    "savol": "IIO, DXX va Milliy gvardiyaning xavfsizlikni ta’minlashdagi roli.",
    "javob": "IIO — kundalik jamoat tartibi va jinoyatchilikka qarshi kurashda; DXX — tashqi va ichki strategik tahdidlar (josuslik, terrorizm)ga qarshi kurashda; Milliy gvardiya — ommaviy tadbirlar va muhim ob’yektlar xavfsizligida rol o‘ynaydi. Ularning hamkorligi yaxlit milliy xavfsizlik tizimini yaratadi."
  },
  {
    "id": 145,
    "savol": "Prokuratura organlarining asosiy vazifasi (misollar bilan).",
    "javob": "Asosiy vazifa — qonunlarning aniq va bir xilda ijro etilishi ustidan nazorat. Misol: tadbirkorlik sub’yektlarining tekshirilishi qonuniyligini nazorat qilish yoki sudlarda jinoiy ishlarni ko‘rishda davlat ayblovini quvvatlash."
  },
  {
    "id": 146,
    "savol": "Prokuratura organlari faoliyatining asosiy yo‘nalishlari.",
    "javob": "Yo‘nalishlar: qonun ijrosini nazorat qilish, inson huquqlari himoyasi, jinoyatchilikka qarshi kurashni muvofiqlashtirish, tergov o‘tkazish, sudda ishtirok etish va qonun ijodkorligida qatnashish."
  },
  {
    "id": 147,
    "savol": "Prokuratura organlarining tuzilishi va tizimi.",
    "javob": "Tizim markazlashgan: Bosh prokuratura, Qoraqalpog‘iston Respublikasi, viloyatlar, Toshkent shahar prokuraturalari, tuman va shahar prokuraturalari hamda Harbiy va Transport prokuraturalaridan iborat."
  },
  {
    "id": 148,
    "savol": "O‘zbekiston Respublikasi Bosh prokurorini lavozimga tayinlash tartibi.",
    "javob": "Bosh prokuror O‘zbekiston Respublikasi Prezidenti tomonidan tayinlanadi va Oliy Majlis Senati tomonidan tasdiqlanadi. Lavozim muddati — 5 yil."
  },
  {
    "id": 149,
    "savol": "O‘zbekiston Respublikasi Bosh prokurorining vakolatlari.",
    "javob": "Vakolatlari: prokuratura tizimiga rahbarlik qilish, buyruqlar chiqarish, quyi prokurorlarni tayinlash, qonun loyihalarini kiritish va qonun buzilishlariga nisbatan protest yoki taqdimnomalar kiritish."
  },
  {
    "id": 150,
    "savol": "Bosh prokurorning Prezidentga beradigan axborotlari mazmuni.",
    "javob": "1) Mamlakatdagi qonuniylik holati; 2) Jinoyatchilik dinamikasi; 3) Prokuratura faoliyati natijalari; 4) Inson huquqlari himoyasining ahvoli; 5) Korrupsiyaga qarshi kurash choralari haqidagi yillik va joriy ma'lumotlar."
  },
  {
    "id": 151,
    "savol": "Prokuratura organlarining boshqa davlat organlari bilan munosabatlari.",
    "javob": "Prokuratura boshqa organlar faoliyatiga aralashmaydi, lekin ularning chiqargan hujjatlari qonunga muvofiqligini tekshiradi. Hamkorlik — jinoyatchilik profilaktikasi bo‘yicha idoralararo kengashlar shaklida amalga oshiriladi."
  },
  {
    "id": 152,
    "savol": "Iqtisodiy jinoyatlarga qarshi kurashish departamenti faoliyati.",
    "javob": "Bosh prokuratura huzuridagi departament iqtisodiy jinoyatlar, soliq qonunchiligi buzilishi va valyuta qimmatliklari noqonuniy aylanishini aniqlash hamda ularga qarshi kurashish bilan shug‘ullanadi."
  },
  {
    "id": 153,
    "savol": "Majburiy ijro byurosi (MIB) faoliyati.",
    "javob": "MIB sud hujjatlari va boshqa organlar qarorlarini majburiy ijro etish, energiya resurslari va suv ta’minoti uchun to‘lovlarning o‘z vaqtida undirilishini ta’minlash bilan shug‘ullanadi."
  },
  {
    "id": 154,
    "savol": "Prokuratura organlarining hay’atlari (kollegiya) va faoliyati.",
    "javob": "Hay’at — maslahat organi bo‘lib, prokuror raisligida tuziladi. Vazifasi: muhim xizmat masalalarini, kadrlar siyosatini va nazorat ishlarini jamoaviy muhokama qilish hamda tegishli qarorlar qabul qilishdir."
  },
  {
    "id": 155,
    "savol": "Prokuror nazoratining turlari.",
    "javob": "1) Umumiy nazorat (qonunlar ijrosi); 2) Shaxs huquqlari himoyasi; 3) Jazo ijrosi joylarida nazorat; 4) Tezkor-qidiruv va tergov ustidan nazorat; 5) Suddagi nazorat."
  },
  {
    "id": 156,
    "savol": "Prokuror nazorati hujjatlari turlari va farqi.",
    "javob": "Hujjatlar: Protest (noqonuniy hujjatni bekor qilish uchun); Taqdimnoma (qonun buzilishi sabablarini yo‘qotish uchun); Qaror (ish qo‘zg‘atish yoki choralar ko‘rish); Ogohlantirish (qonun buzilishining oldini olish uchun)."
  },
  {
    "id": 157,
    "savol": "'Advokatura toʻgʻrisida'gi qonunning sharhi.",
    "javob": "Ushbu qonun advokatlik faoliyatining huquqiy asoslarini, advokat bo‘lish tartibi, ularning huquqlari, majburiyatlari va daxlsizligini belgilaydi. Advokaturani mustaqil, o‘z-o‘zini boshqaruvchi tuzilma sifatida kafolatlaydi."
  },
  {
    "id": 158,
    "savol": "Umumyurisdiksiya sudlari tizimi.",
    "javob": "Bunga fuqarolik, jinoiy, iqtisodiy va ma’muriy ishlar bo‘yicha tuman, viloyat sudlari va Oliy sud kiradi. Ular fuqarolar va yuridik shaxslar o‘rtasidagi umumiy nizolarni hal qiladi."
  },
  {
    "id": 159,
    "savol": "Umumyurisdiksiya sudlari nima sababdan ikki bo‘g‘indan iborat?",
    "javob": "Mening taxminimcha, bu boshqaruvni soddalashtirish va sud himoyasini aholiga yaqinlashtirish uchun qilingan. Tuman (quyi) va viloyat (yuqori) bo‘g‘inlari ishlarni birinchi va apellyatsiya instansiyasida tezkor ko‘rish imkonini beradi."
  },
  {
    "id": 160,
    "savol": "Viloyat va unga tenglashtirilgan sudlar tarkibi.",
    "javob": "Sud tarkibi: sud raisi, rais o‘rinbosarlari, sudyalar va sud xodimlaridan iborat. Tuzilmasida sud rayosati hamda fuqarolik, jinoiy, iqtisodiy va ma’muriy ishlar bo‘yicha sudlov hay’atlari mavjud."
  },
  {
    "id": 161,
    "savol": "Viloyat sudi rayosati vakolatlari.",
    "javob": "Rayosat — kollegial organ bo‘lib, sud apparati ishini tashkil etadi, sud amaliyotini umumlashtiradi va qonun hujjatlariga muvofiq kadrlar hamda tashkiliy masalalarni hal qiladi."
  },
  {
    "id": 162,
    "savol": "Viloyat sudining sudlov hay’atlari faoliyati.",
    "javob": "Hay’atlar ishlarni birinchi instansiyada (murakkab ishlar), apellyatsiya va kassaсiya tartibida ko‘rib chiqadi. Har bir hay’at o‘zining ixtisoslashgan yo‘nalishi (masalan, jinoyat ishlari) bo‘yicha faoliyat yuritadi."
  },
  {
    "id": 163,
    "savol": "O‘zbekistonda ma’muriy sudlar tashkil etish asoslari.",
    "javob": "Asos — davlat organlarining qarorlari ustidan fuqarolarning sudga shikoyat qilish huquqini ta’minlash. Bu ma'muriy organlar ustidan sud nazoratini o'rnatish orqali qonuniylikni ta'minlaydi."
  },
  {
    "id": 164,
    "savol": "Ma’muriy sudlar qanday turdagi nizolarni hal etadi?",
    "javob": "Ular ommaviy-huquqiy munosabatlardan kelib chiqadigan nizolarni: davlat organlarining g‘ayriqonuniy qarorlari, harakatlari yoki harakatsizligi ustidan berilgan shikoyatlarni ko‘rib chiqadi."
  },
  {
    "id": 165,
    "savol": "O‘zbekistonda harbiy sudlar tizimi.",
    "javob": "Tizim: Oliy sudning Harbiy hay’ati, Hududiy (garnizon) harbiy sudlaridan iborat. Ular Qurolli Kuchlar va boshqa harbiy tuzilmalarda harbiy intizomni saqlashga xizmat qiladi."
  },
  {
    "id": 166,
    "savol": "Harbiy sudlar sudloviga taalluqli ishlar toifasi.",
    "javob": "Bunga harbiy xizmatchilar tomonidan sodir etilgan barcha jinoyatlar, harbiy qismlardagi fuqarolik nizolari va harbiy xizmatni o‘tash bilan bog‘liq bo‘lgan ma’muriy ishlar kiradi."
  },
  {
    "id": 167,
    "savol": "Sudyalar assotsiatsiyasining maqsadi va vazifalari.",
    "javob": "Maqsad — sudyalarning mustaqilligini himoya qilish. Vazifalari: sud-huquq islohotlarida qatnashish, sudyalarning ijtimoiy himoyasini kuchaytirish va ularning malakasini oshirishga ko‘maklashish."
  },
  {
    "id": 168,
    "savol": "Sudyalar assotsiatsiyasi asosiy tuzilmalari faoliyati.",
    "javob": "Tuzilmaga Markaziy kengash va hududiy bo‘limlar kiradi. Ular konferensiyalar tashkil etadi, sudyalar huquqlari buzilganda xulosalar beradi va xalqaro hamkorlikni olib boradi."
  },
  {
    "id": 169,
    "savol": "Sudyalar assotsiatsiyasi sud faoliyatiga aralashmaslik prinsipining sababi.",
    "javob": "Sudning mustaqilligini saqlash uchun. Assotsiatsiya — jamoat tashkiloti bo‘lib, uning vazifasi tizimni qo‘llab-quvvatlash, lekin sudya chiqarayotgan aniq bir hukm yoki qarorga ta'sir o'tkazish emas."
  },
  {
    "id": 170,
    "savol": "Sudyalar Oliy kengashini tashkil etishning ijtimoiy zarurati.",
    "javob": "Zarurat — sudyalarni tayinlash jarayonini ijro etuvchi hokimiyatdan ajratish va bu jarayonni shaffof, xolis hamda korrupsiyadan xoli qilish orqali sud mustaqilligini ta'minlashdir."
  },
  {
    "id": 171,
    "savol": "Sudyalar Oliy kengashi to‘g‘risidagi qonunning asosiy qoidalari.",
    "javob": "Qonun Kengashning maqomi, sudyalarni tanlash va tayinlash tartibi, sudyalarning daxlsizligini himoya qilish mexanizmlari va intizomiy javobgarlik masalalarini belgilaydi."
  },
  {
    "id": 172,
    "savol": "Sudyalar Oliy kengashi faoliyatining muhim jihatlari.",
    "javob": "Muhim jihat — sudyalik lavozimiga nomzodlarni tanlov asosida tanlash, sudyalar korpusini shakllantirish va ularning xizmat muddati tugaganda vakolatlarini uzaytirish yoki to'xtatish haqida qaror qabul qilish."
  },
  {
    "id": 173,
    "savol": "Sudyalar assotsiatsiyasi va Sudyalar Oliy kengashi o‘xshash va farqli jihatlari.",
    "javob": "O‘xshashlik: har ikkalasi sud tizimi manfaati uchun ishlaydi. Farqi: Kengash — davlat organi (tayinlovlar bilan shug‘ullanadi), Assotsiatsiya — jamoat birlashmasi (manfaatlarni himoya qiladi)."
  },
  {
    "id": 174,
    "savol": "Sudyalar Oliy kengashi tarkibi va shakllantirish tartibi.",
    "javob": "Kengash raisi Prezident tomonidan tayinlanadi. Tarkibiga sudyalar, huquqni muhofaza qiluvchi organlar vakillari va fuqarolik jamiyati institutlari a’zolari kiradi (jami 21 nafar a’zo)."
  },
  {
    "id": 175,
    "savol": "Sudyalar Oliy kengashi faoliyatini tashkil etish masalalari.",
    "javob": "Faoliyat Kengash majlislari orqali tashkil etiladi. Kengash huzurida doimiy ishlovchi inspeksiya va sudyalar malakasini baholovchi komissiyalar faoliyat yuritadi."
  },
  {
    "id": 176,
    "savol": "Sudyalar Oliy maktabining asosiy vazifasi.",
    "javob": "Vazifasi — sudyalik lavozimiga nomzodlarni tayyorlash, sudyalar va sud apparati xodimlarining malakasini oshirish hamda tizim uchun ilmiy kadrlar tayyorlash."
  },
  {
    "id": 177,
    "savol": "Sudyalar Oliy maktabi faoliyat yo‘nalishlari.",
    "javob": "Yo‘nalishlar: o‘quv jarayonini tashkil etish, sud amaliyoti bo‘yicha ilmiy tadqiqotlar o‘tkazish, psixologik tayyorgarlik va sudyalik etikasi bo‘yicha darslar o‘tish."
  },
  {
    "id": 178,
    "savol": "Assotsiatsiya, Kengash va Maktabning sud faoliyatiga ta’siri.",
    "javob": "Bu uchlik 'zanjir' vazifasini o‘taydi: Maktab bilim beradi, Kengash munosiblarni tanlaydi, Assotsiatsiya esa ularning huquqlarini himoya qiladi. Bu yaxlit tizim sudlov sifatini va mustaqilligini oshiradi."
  },
  {
    "id": 179,
    "savol": "Sud tizimida O‘zbekiston Respublikasi Oliy sudining o‘rni.",
    "javob": "Oliy sud — sud hokimiyatining eng yuqori organi. U quyi sudlar ustidan nazorat qiladi, sud amaliyotini birxillashtiradi va qonunlarni qo‘llash bo‘yicha rasmiy tushuntirishlar beradi."
  },
  {
    "id": 180,
    "savol": "O‘zbekiston Respublikasi Oliy sudining tarkibi va tuzilishi.",
    "javob": "Tarkibi: Rais, rais o‘rinbosarlari va sudyalar. Tuzilishi: Plenum, Rayosat va sudlov hay’atlari (fuqarolik, jinoiy, iqtisodiy va ma’muriy ishlar bo‘yicha)."
  },
  {
    "id": 181,
    "savol": "O‘zbekiston Respublikasi Oliy sudining vakolatlariga to‘xtalib o‘ting.",
    "javob": "Oliy sud fuqarolik, jinoiy, iqtisodiy va ma’muriy sudlov ishlari bo‘yicha yuqori organ hisoblanadi. U quyi sudlarning qarorlari ustidan nazorat yuritadi, qonunlarni qo‘llash bo‘yicha Plenum qarorlari orqali tushuntirishlar beradi va qonunchilik tashabbusi huquqiga ega."
  },
  {
    "id": 182,
    "savol": "O‘zbekiston Respublikasi Oliy Sudi Plenumi faoliyatini muhokama qiling.",
    "javob": "Plenum Oliy sudning eng yuqori organi bo‘lib, barcha sudyalar va quyi sud raislaridan iborat. U ishlarni ko‘rmaydi, balki sud amaliyotini umumlashtirib, barcha sudlar uchun majburiy bo‘lgan tushuntirishlar (Plenum qarorlari) qabul qiladi."
  },
  {
    "id": 183,
    "savol": "O‘zbekiston Respublikasi Oliy Sudi Prezidiumi va hay’atlari qanday ishlarni amalga oshiradi.",
    "javob": "Rayosat (Prezidium) sud ishini tashkiliy muvofiqlashtiradi. Sudlov hay’atlari esa bevosita ishlarni (fuqarolik, jinoiy va h.k.) kassatsiya va taftish tartibida ko‘rib chiqadi."
  },
  {
    "id": 184,
    "savol": "O‘zbekiston Respublikasi Oliy sudining apparati haqida aytib bering.",
    "javob": "Apparat — sudning tashkiliy, axborot va moddiy-texnik faoliyatini ta’minlovchi tuzilmadir. Unga kotibiyat, bo‘limlar va boshqarmalar kiradi. Ular sud majlislarini tashkil etish va hujjatlar aylanishiga mas’ul."
  },
  {
    "id": 185,
    "savol": "Oliy sud faoliyatida Oliy sud raisining o‘rnini tahlil qiling.",
    "javob": "Rais Oliy sudga rahbarlik qiladi, Plenum va Rayosat majlislarini chaqiradi, ishlar taqsimotini nazorat qiladi va sud tizimini xalqaro hamda davlat darajasida taqdim etadi."
  },
  {
    "id": 186,
    "savol": "Oliy sud va quyi sudlar o‘rtasidagi o‘zaro ta’sir va munosabatlar.",
    "javob": "Munosabat 'vertikal' nazoratga asoslangan. Oliy sud quyi sudlar yo‘l qo‘ygan xatolarni tuzatadi va ularga uslubiy yordam ko‘rsatadi. Quyi sudlar esa Oliy sud tushuntirishlariga qat’iy amal qilishi shart."
  },
  {
    "id": 187,
    "savol": "Oliy sud Plenumi qarorini qabul qilish tartibini tushuntiring.",
    "javob": "Qarorlar Plenum majlisida a'zolarning kamida uchdan ikki qismi ishtirok etganda, ochiq ovoz berish va ko'pchilik ovoz bilan qabul qilinadi. Ularni rais va Plenum kotibi imzolaydi."
  },
  {
    "id": 188,
    "savol": "Oliy sud Rayosati va sudlov hay’atlari vakolatlarining o‘xshash va farqli jihatlari.",
    "javob": "O‘xshashlik: ikkalasi ham sudning ichki tuzilmasi. Farq: Rayosat asosan tashkiliy va nazorat masalalari bilan shug‘ullanadi, hay’atlar esa bevosita muayyan ishlar bo‘yicha sudlovni amalga oshiradi."
  },
  {
    "id": 189,
    "savol": "Konstitutsiyaviy nazorat tushunchasi va uning asoslarini tahlil eting.",
    "javob": "Konstitutsiyaviy nazorat — qabul qilinayotgan qonunlar va hujjatlarning Konstitutsiyaga muvofiqligini tekshirishdir. Bu davlatda qonun ustuvorligini ta'minlashning oliy shakli hisoblanadi."
  },
  {
    "id": 190,
    "savol": "O‘zbekiston Respublikasi Konstitutsiyaviy sudi va uning vakolatlarini aytib bering.",
    "javob": "Vakolatlari: qonunlarning Konstitutsiyaga muvofiqligini aniqlash, referendumga qo‘yilayotgan masalalar bo‘yicha xulosa berish va Konstitutsiya normalariga rasmiy sharh berish."
  },
  {
    "id": 191,
    "savol": "Konstitutsiyaviy sud apparati, funksiyasi va shakllanish tartibi.",
    "javob": "Apparat sudyalarga ish materiallarini tayyorlashda ko‘maklashadi. U yuridik, tashkiliy va tahliliy bo‘limlardan iborat bo‘lib, sud raisi tomonidan shakllantiriladi."
  },
  {
    "id": 192,
    "savol": "Konstitutsiyaviy sud qarorlarining yuridik ahamiyati va tuzilishi.",
    "javob": "Qarorlar yakuniy hisoblanadi va ustidan shikoyat qilinmaydi. Tuzilishi: kirish, bayon, asoslantiruvchi va qaror qismlaridan iborat. Ular e'lon qilingan paytdan kuchga kiradi."
  },
  {
    "id": 193,
    "savol": "Konstitutsiyaviy sud faoliyatining asosiy prinsiplari.",
    "javob": "Mustaqillik, kollegiallik, oshkoralik, sudyalar huquqlarining tengligi va qarorlarning majburiyligi."
  },
  {
    "id": 194,
    "savol": "Konstitutsiyaviy nazoratni alohida tuzilma orqali amalga oshirish samaradorligi.",
    "javob": "Mening taxminimcha, bu juda to‘g‘ri model, chunki u 'cheklash va muvozanat' tizimini ta’minlaydi. Alohida sud bo‘lishi siyosiy bosimlardan xoli holda faqat huquqiy tahlil qilish imkonini beradi."
  },
  {
    "id": 195,
    "savol": "Konstitutsiyaviy sudning umumiy yurisdiksiya sudlaridan farqi.",
    "javob": "Umumiy sudlar odamlar o‘rtasidagi nizoni hal qiladi. Konstitutsiyaviy sud esa odamlarni emas, 'qonunlarni sud qiladi' (norma nazorati bilan shug‘ullanadi)."
  },
  {
    "id": 196,
    "savol": "Qanday hujjatlar Konstitutsiyaviy nazorat ob’yektlari bo‘lishi mumkin?",
    "javob": "Qonunlar, Prezident farmonlari, hukumat qarorlari, xalqaro shartnomalar (imzolanguniga qadar) va mahalliy davlat hokimiyati qarorlari."
  },
  {
    "id": 197,
    "savol": "Konstitutsiyaviy sudni saylash tartibi.",
    "javob": "Sudyalar Prezident taqdimiga binoan Senat tomonidan saylanadi. Har bir sudya qayta saylanish huquqisiz 10 yil muddatga saylanadi."
  },
  {
    "id": 198,
    "savol": "Konstitutsiyaviy sud sudyasi bo‘lish uchun talablar.",
    "javob": "Siyosat va huquq sohasidagi yuksak malakali mutaxassis, 30 yoshdan kichik bo'lmagan, oliy yuridik ma'lumotli va kamida 15 yillik mutaxassislik stajiga ega bo'lgan fuqaro."
  },
  {
    "id": 199,
    "savol": "Huquqni muhofaza qilish idoralari islohotlari bo’yicha fikrlar.",
    "javob": "Islohotlar 'jazolovchi' organdan 'xizmat ko‘rsatuvchi' va 'himoya qiluvchi' organga aylanishga qaratilgan. Raqamlashtirish korrupsiyani kamaytirishda asosiy drayver bo‘lmoqda."
  },
  {
    "id": 200,
    "savol": "Huquqni muhofaza qilish idoralari fani tushunchasi.",
    "javob": "Bu fan davlat organlarining tashkil etilishi, ularning qonunni himoya qilish, huquq-tartibotni saqlash va adolatni qaror toptirish bo‘yicha vakolatlarini o‘rganadigan o‘quv fanidir."
  },
  {
    "id": 201,
    "savol": "Advokatura idoralari islohotlari bo’yicha fikrlar.",
    "javob": "Islohotlar advokatlarning tergovdagi tengligini ta’minlashga qaratilgan. 'E-advokat' tizimi va litsenziya olishdagi byurokratiyaning qisqarishi sohaning jozibadorligini oshirdi."
  },
  {
    "id": 202,
    "savol": "Prokuratura xodimining vakolat muddati.",
    "javob": "Bosh prokuror 5 yilga tayinlanadi. Quyi prokurorlar ham odatda 5 yillik muddatga tayinlanadi va rotatsiya (o‘rin almashtirish) tartibida faoliyat yuritadi."
  },
  {
    "id": 203,
    "savol": "Prokuratura organlari faoliyatida mustaqillik prinsipi.",
    "javob": "Prokurorlar o‘z vakolatlarini har qanday davlat organi yoki mansabdor shaxsdan mustaqil ravishda, faqat qonunga bo‘ysunib amalga oshiradilar."
  },
  {
    "id": 204,
    "savol": "Prokuratura organlari qaysi prinsiplarga asoslanadi?",
    "javob": "Qonuniylik, yagonalik, markazlashganlik, mustaqillik va oshkoralik."
  },
  {
    "id": 205,
    "savol": "Prokuratura xodimlariga nisbatan siyosiy partiyalarga a’zolik masalasi.",
    "javob": "Prokuratura xodimlari o‘z xizmat faoliyati davomida siyosiy partiyalarga a’zolikni to‘xtatib turishlari shart. Bu ularning xolisligini ta’minlaydi."
  },
  {
    "id": 206,
    "savol": "Oʻzbekistonda Huquqni muhofaza qilish idoralari tahlili.",
    "javob": "Tizimga Sud, Prokuratura, IIV, DXX, Milliy gvardiya, Bojxona, Soliq, Adliya va Advokatura kiradi. Ularning har biri qonun ustuvorligining ma'lum bir segmentiga mas'ul."
  },
  {
    "id": 207,
    "savol": "Sudya bo‘lish uchun qanday talablar belgilangan?",
    "javob": "35 yoshdan kichik bo'lmagan, oliy yuridik ma'lumotli, yuridik ixtisosligi bo‘yicha kamida 7 yillik stajga ega, Sudyalar Oliy maktabini tamomlagan fuqaro sudya bo'lishi mumkin."
  },
  {
    "id": 208,
    "savol": "Jinoyat ishini qo‘zg‘atish tushunchasi.",
    "javob": "Bu — vakolatli organlar tomonidan jinoyat alomatlari aniqlangan taqdirda, rasmiy tergov jarayonini boshlash haqidagi huquqiy qarordir."
  },
  {
    "id": 209,
    "savol": "Ichki ishlar organlarining asosiy vazifalari va huquqiy asoslari.",
    "javob": "Vazifasi: jamoat tartibi va fuqarolar xavfsizligi. Huquqiy asosi: 'Ichki ishlar organlari to‘g‘risida'gi Qonun va O‘zbekiston Konstitutsiyasi."
  },
  {
    "id": 210,
    "savol": "Qonuniylik va huquq-tartibotni muhofaza qilish vazifalari kimlarga yuklatilgan?",
    "javob": "Barcha davlat organlari va fuqarolarga, biroq maxsus profilaktika va kurash vazifasi IIV, Prokuratura, DXX va Milliy gvardiyaga yuklatilgan."
  },
  {
    "id": 211,
    "savol": "Jinoyatchilikka qarshi kurash bilan shugʻullanuvchi idoralar tahlili.",
    "javob": "IIV (umumiy jinoyatlar), Prokuratura (tergov nazorati), DXX (davlat xavfsizligi), Bojxona va Soliq (iqtisodiy jinoyatlar) ixtisoslashgan yo'nalishlarda kurashadi."
  },
  {
    "id": 212,
    "savol": "Milliy gvardiya tuzilmasi tahlili.",
    "javob": "Harbiylashtirilgan tuzilma bo‘lib, markaziy apparat, hududiy boshqarmalar, tezkor harakatlanuvchi bo‘linmalar va qo‘riqlash xizmatidan iborat."
  },
  {
    "id": 213,
    "savol": "O‘zbekiston Respublikasi IIV vazifalari tahlili.",
    "javob": "Huquqbuzarliklar profilaktikasi, pasport-viza tizimi, yo‘l harakati xavfsizligi, jamoat tartibi va tergov yuritish asosiy vazifalardir."
  },
  {
    "id": 214,
    "savol": "Mediatsiya instituti faoliyatini izohlang.",
    "javob": "Bu nizolarni uchinchi betaraf taraf (mediator) ko‘magida, sudga bormasdan, o‘zaro kelishuv asosida hal qilish jarayonidir."
  },
  {
    "id": 215,
    "savol": "Milliy gvardiya tizimi asosiy vazifalarini tahlil qiling.",
    "javob": "Vazifalar: jamoat xavfsizligi, muhim ob'yektlarni qo'riqlash, qurol aylanishini nazorat qilish va aholiga yordam ko'rsatish (Milliy gvardiya 'Xalqchil tuzilma')."
  },
  {
    "id": 216,
    "savol": "Sudlov hay’atlari faoliyatini tahlil eting.",
    "javob": "Hay’atlar ixtisoslashgan (jinoiy, fuqarolik va h.k.) bo‘lib, kollegial tartibda ishlarni ko‘radi. Ular adolatli va professional hukm chiqarishga mas'ul tuzilmalardir."
  }
]