[
  {
    "id": 1,
    "savol": "Inson huquqlari tushunchasining shakllanishiga ta’sir etgan asosiy nazariy yondashuvlarni izohlang.",
    "javob": "Inson huquqlari shakllanishiga tabiiy huquq nazariyasi (huquqlar tug‘ma ekanligi), ijtimoiy shartnoma nazariyasi (davlat va fuqaro o‘rtasidagi kelishuv), liberalizm (shaxs erkinligi ustuvorligi) va demokratik nazariyalar (xalq hokimiyatchiligi) asosiy ta’sir ko‘rsatgan."
  },
  {
    "id": 2,
    "savol": "Tabiiy-huquqiy konsepsiya va pozitivistik yondashuvning inson huquqlariga munosabatini solishtiring.",
    "javob": "Tabiiy-huquqiy konsepsiyaga ko‘ra, huquqlar insonga tabiatdan berilgan va davlat irodasiga bog‘liq emas. Pozitivistik yondashuvda esa, inson huquqlari faqat davlat tomonidan qonun hujjatlarida mustahkamlangandan keyingina huquqiy kuchga ega bo‘ladi deb hisoblanadi."
  },
  {
    "id": 3,
    "savol": "“Inson”, “shaxs” va “fuqaro” tushunchalarining yuridik farqlarini tushuntirib bering.",
    "javob": "“Inson” — biologik va ijtimoiy mavjudot sifatidagi barcha odamlarni ifodalaydi. “Shaxs” — jamiyatda ma’lum ijtimoiy mavqega va ongga ega bo‘lgan sub’yektdir. “Fuqaro” — muayyan davlat bilan barqaror huquqiy aloqaga (fuqarolikka) ega bo‘lgan va o‘zaro huquq hamda majburiyatlar bilan bog‘langan shaxsdir."
  },
  {
    "id": 4,
    "savol": "Inson huquqlarining ajralmaslik xususiyati nimada namoyon bo‘ladi?",
    "javob": "Ajralmaslik xususiyati shunda namoyon bo‘ladiki, hech kim o‘z ixtiyori bilan bu huquqlardan voz kecha olmaydi va hech bir kuch (davlat yoki shaxs) insonni bu huquqlardan qonuniy ravishda mahrum eta olmaydi. Ular insonning ajralmas sifati hisoblanadi."
  },
  {
    "id": 5,
    "savol": "Inson huquqlarining tasniflanishi qanday mezonlar asosida amalga oshiriladi?",
    "javob": "Tasniflash asosan: 1) paydo bo‘lish vaqti (avlodlar); 2) ijtimoiy hayot sohalari (shaxsiy, siyosiy, iqtisodiy, ijtimoiy, madaniy); 3) amalga oshirish sub’yektlari (individual va kollektiv) kabi mezonlar asosida amalga oshiriladi."
  },
  {
    "id": 6,
    "savol": "Fuqarolik (shaxsiy) huquqlarining jamiyat taraqqiyotidagi o‘rni qanday?",
    "javob": "Shaxsiy huquqlar insonning yashashi, erkinligi va daxlsizligini ta’minlovchi poydevordir. Ular shaxsni davlatning asossiz aralashuvidan himoya qiladi, jamiyatda xavfsizlik va barqarorlikni ta’minlab, boshqa barcha (siyosiy, iqtisodiy) huquqlarni amalga oshirish uchun zamin yaratadi."
  },
  {
    "id": 7,
    "savol": "Inson huquqlari va davlat majburiyatlari o‘rtasidagi o‘zaro bog‘liqlikni tahlil qiling.",
    "javob": "Bu bog‘liqlik 'huquq va majburiyat birligi'ga asoslanadi. Insonning huquqi davlatning majburiyatini keltirib chiqaradi. Davlatning uchta asosiy majburiyati bor: hurmat qilish (aralashmaslik), himoya qilish (buzilishini oldini olish) va ta’minlash (sharoit yaratish)."
  },
  {
    "id": 8,
    "savol": "Inson huquqlarining boshqa fanlar bilan aloqadorligini asoslab bering.",
    "javob": "Inson huquqlari fanlararo xarakterga ega: falsafa (huquq mohiyati), huquqshunoslik (normativ asoslar), siyosatshunoslik (davlat boshqaruvi), sotsiologiya (jamiyatdagi holati) va etika (axloqiy me’yorlar) bilan uzviy bog‘liq."
  },
  {
    "id": 9,
    "savol": "Inson huquqlari sohasida ta’limning ahamiyati nimada?",
    "javob": "Inson huquqlari ta’limi jamiyatda huquqiy madaniyatni yuksaltirish, har bir shaxsga o‘z huquqlarini himoya qilishni o‘rgatish, kamsitish va zulmga nisbatan murosasizlikni shakllantirish hamda demokratik qadriyatlarni mustahkamlash uchun xizmat qiladi."
  },
  {
    "id": 10,
    "savol": "Bugungi globallashuv sharoitida inson huquqlarining dolzarbligini tushuntiring.",
    "javob": "Globallashuv davrida inson huquqlari milliy chegaralardan chiqib, xalqaro ahamiyat kasb etdi. Axborot xavfsizligi, ekologik inqirozlar, xalqaro migratsiya va sun’iy intellekt kabi yangi tahdidlar sharoitida inson qadr-qimmatini himoya qilishning yagona universal standarti sifatida ularning o‘rni yanada oshdi."
  },
  {
    "id": 11,
    "savol": "Inson huquqlarining mohiyati va tarkibiy qismlarini izohlang.",
    "javob": "Inson huquqlarining mohiyati inson qadr-qimmati, erkinligi va tengligini himoya qilishga qaratilgan. Uning tarkibiy qismlari: sub’yekt (inson), ob’yekt (hayot, erkinlik, mulk kabi ne’matlar) va mazmun (davlatdan muayyan harakatlarni talab qilish yoki aralashmaslikni so'rash huquqi) dan iborat."
  },
  {
    "id": 12,
    "savol": "Inson qadr-qimmati tushunchasi va uning huquqiy mazmunini ochib bering.",
    "javob": "Inson qadr-qimmati — bu insonning o'z-o'zini anglash va jamiyat tomonidan e'tirof etilishining ma'naviy-huquqiy asosi. Huquqiy mazmuni: shaxsga nisbatan g'ayriinsoniy muomalani taqiqlash, kamsitishga yo'l qo'ymaslik va har bir insonning o'zligini erkin rivojlantirishi uchun huquqiy kafolatlar yaratishdir."
  },
  {
    "id": 13,
    "savol": "Inson huquqlarining jahon sivilizatsiyasidagi o‘rni nimada namoyon bo‘ladi?",
    "javob": "Ular umuminsoniy qadriyatlar tizimini shakllantiradi, xalqaro tinchlik va xavfsizlikning asosi bo'lib xizmat qiladi. Sivilizatsiyalashgan jamiyatda hokimiyatning qonuniyligi va demokratik taraqqiyot darajasi aynan inson huquqlarining ta'minlanganligi bilan o'lchanadi."
  },
  {
    "id": 14,
    "savol": "Inson huquqlarining rivojlanish dinamikasi qanday tarixiy bosqichlarni o‘z ichiga oladi?",
    "javob": "To'rt bosqich: 1) Antik va o'rta asrlar (tabiiy huquq kurtaklari); 2) Buyuk geografik kashfiyotlar va burjua inqiloblari davri (ilk huquqiy hujjatlar: Magna Carta, Bill of Rights); 3) Ikkinchi jahon urushidan keyingi davr (xalqaro kodifikatsiya); 4) Zamonaviy davr (yangi avlod huquqlari va raqamli huquqlar)."
  },
  {
    "id": 15,
    "savol": "Fuqarolik tushunchasi va uning inson huquqlaridagi ahamiyatini tushuntiring.",
    "javob": "Fuqarolik — shaxs bilan davlat o'rtasidagi barqaror siyosiy-huquqiy aloqadir. Ahamiyati: fuqarolik shaxsga nafaqat universal inson huquqlaridan, balki muayyan davlatdagi siyosiy (saylash, davlat xizmati) va ijtimoiy huquqlardan to'liq foydalanish imkonini beradi."
  },
  {
    "id": 16,
    "savol": "Fuqarolikni olishning qondoshlik va tuproqdoshlik tamoyillarini solishtiring.",
    "javob": "Qondoshlik (jus sanguinis) tamoyilida fuqarolik bolaning ota-onasi fuqaroligiga ko'ra belgilanadi (masalan, O'zbekistonda). Tuproqdoshlik (jus soli) tamoyilida esa bola ota-onasining fuqaroligidan qat'i nazar, u tug'ilgan davlat hududiga ko'ra fuqarolik oladi (masalan, AQSH)."
  },
  {
    "id": 17,
    "savol": "O‘zbekistonda fuqarolikni olish shartlari qanday?",
    "javob": "Asosiy shartlar: 1) chet el fuqaroligidan voz kechish; 2) O'zbekiston hududida besh yil davomida doimiy yashash (soddalashtirilgan tartib mustasno); 3) qonuniy yashash manbaiga ega bo'lish; 4) Konstitutsiyani tan olish va davlat tilini muloqot darajasida bilish."
  },
  {
    "id": 18,
    "savol": "Fuqarolikni yo‘qotish va undan chiqish asoslarini izohlang.",
    "javob": "Fuqarolikdan chiqish — shaxsning ixtiyoriy arizasiga binoan amalga oshadi. Fuqarolikni yo'qotish — shaxsning chet davlatda davlat xizmatiga kirishi, chet elda konsullik hisobiga turmasligi yoki soxta hujjatlar asosida fuqarolik olganligi aniqlanishi kabi holatlarda davlat tashabbusi bilan sodir bo'ladi."
  },
  {
    "id": 19,
    "savol": "Inson huquqlari borasida xalqaro-huquqiy standartlar deganda nimani tushunasiz? Ularning yuridik kuchi qanday?",
    "javob": "Xalqaro-huquqiy standartlar — bu xalqaro shartnomalarda (IHUD, Paktlar) mustahkamlangan inson huquqlarining minimal me'yorlaridir. Ularning yuridik kuchi milliy qonunchilikdan ustun turadi (O'zbekiston Konstitutsiyasining 1-moddasiga muvofiq)."
  },
  {
    "id": 20,
    "savol": "Inson huquqlarining universalligi tamoyilini asoslab bering.",
    "javob": "Bu tamoyil inson huquqlari barcha odamlarga, ularning turar joyi, etnik kelib chiqishi, jinsi va diniy qarashlaridan qat'i nazar birdek tegishli ekanligini anglatadi. Universallik har bir insonning biologik bir xilligi va ijtimoiy tengligi g'oyasiga asoslanadi."
  },
  {
    "id": 21,
    "savol": "Shaxsning huquqiy maqomi tushunchasini izohlang.",
    "javob": "Shaxsning huquqiy maqomi — bu shaxsning jamiyatdagi ijtimoiy o‘rni qonun normalari bilan mustahkamlangan yig‘indisidir. U shaxsning davlat va jamiyat bilan o‘zaro munosabatlarini belgilovchi huquqiy holatini ifodalaydi."
  },
  {
    "id": 22,
    "savol": "Shaxs huquqiy maqomining asosiy elementlarini sanab bering.",
    "javob": "Asosiy elementlar: 1) sub’yektiv huquqlar; 2) yuridik majburiyatlar; 3) qonuniy manfaatlar; 4) huquq layoqati va muomala layoqati; 5) fuqarolik; 6) huquqiy prinsiplar; 7) yuridik javobgarlik."
  },
  {
    "id": 23,
    "savol": "Umumiy (konstitutsiyaviy) huquqiy maqom nima?",
    "javob": "Umumiy maqom — bu mamlakatning barcha fuqarolari uchun bir xil bo‘lgan, Konstitutsiya bilan mustahkamlangan asosiy huquq va majburiyatlar majmuidir. U shaxsning boshqa barcha turdagi maqomlari uchun poydevor bo‘lib xizmat qiladi."
  },
  {
    "id": 24,
    "savol": "Maxsus huquqiy maqomning xususiyatlarini tushuntiring.",
    "javob": "Maxsus maqom muayyan toifadagi shaxslarga (masalan, talabalar, harbiylar, pensionerlar, o‘qituvchilar) tegishli bo‘ladi. Xususiyati shundaki, u umumiy maqomga qo‘shimcha ravishda ushbu guruh faoliyati yoki ijtimoiy holati bilan bog‘liq maxsus huquq va majburiyatlarni beradi."
  },
  {
    "id": 25,
    "savol": "Individual huquqiy maqom qanday belgilanadi?",
    "javob": "Individual maqom aniq bir shaxsning o‘ziga xos xususiyatlari (yoshi, jinsi, oilaviy ahvoli, ish joyi, lavozimi) asosida shakllanadi. U umumiy va maxsus maqomlarning aniq bir shaxs hayotidagi konkret ko‘rinishidir."
  },
  {
    "id": 26,
    "savol": "Huquq layoqati va muomala layoqati tushunchalarini solishtiring.",
    "javob": "Huquq layoqati — huquq va majburiyatlarga ega bo‘lish imkoniyati bo‘lib, u inson tug‘ilganidan boshlanib, vafoti bilan tugaydi. Muomala layoqati — shaxsning o‘z harakatlari bilan huquq va majburiyatlarga ega bo‘lish qobiliyati bo‘lib, u yosh va ruhiy holatga bog‘liq holda to‘liq, qisman yoki cheklangan bo‘lishi mumkin."
  },
  {
    "id": 27,
    "savol": "Fuqarolik shaxs huquqiy maqomiga qanday ta’sir qiladi?",
    "javob": "Fuqarolik shaxs maqomini eng yuqori darajaga ko‘taradi. Faqat fuqarolar davlat boshqaruvida qatnashish, saylash va saylanish, davlat xizmatiga kirish kabi siyosiy huquqlarga ega bo‘ladilar hamda davlatning doimiy huquqiy himoyasida bo‘ladilar."
  },
  {
    "id": 28,
    "savol": "Qonuniy manfaat tushunchasini izohlang.",
    "javob": "Qonuniy manfaat — bu qonunda aniq huquq sifatida yozilmagan bo‘lsa-da, qonunning mazmuni va ruhidan kelib chiqadigan, shaxs intiladigan va davlat tomonidan himoya qilinadigan ijtimoiy ne’matdir (masalan, jazoni yengillatishni so‘rash manfaati)."
  },
  {
    "id": 29,
    "savol": "Huquq va majburiyatlar o‘rtasidagi nisbatni tushuntiring.",
    "javob": "Huquq va majburiyat uzviy bog‘liq: bir shaxsning huquqi boshqa shaxs yoki davlatning majburiyatini keltirib chiqaradi. Majburiyatsiz huquq — o‘zboshimchalikni, huquqsiz majburiyat esa — qullikni anglatadi. Ularning mutanosibligi jamiyatda adolatni ta’minlaydi."
  },
  {
    "id": 30,
    "savol": "Shaxs huquqiy maqomining jamiyatdagi ahamiyatini baholang.",
    "javob": "Huquqiy maqom shaxsning jamiyatdagi erkinlik darajasini va xavfsizligini belgilaydi. U davlat hokimiyatini cheklab, shaxs manfaatlari himoyasini kafolatlaydi, ijtimoiy munosabatlarni tartibga soladi va shaxsning har tomonlama rivojlanishi uchun huquqiy muhit yaratadi."
  },
  {
    "id": 31,
    "savol": "Inson huquqlarini cheklash tushunchasi nimani anglatadi?",
    "javob": "Inson huquqlarini cheklash — bu muayyan ijtimoiy manfaatlarni himoya qilish maqsadida qonun bilan belgilangan, inson huquq va erkinliklarining amal qilish doirasini va mazmunini vaqtincha yoki muayyan sharoitda toraytirishdir."
  },
  {
    "id": 32,
    "savol": "Huquq va erkinliklarni cheklashning qonuniy shartlarini izohlang.",
    "javob": "Cheklashning uchta majburiy sharti mavjud: 1) Qonun bilan belgilangan bo‘lishi (legallik); 2) Aniq ijtimoiy maqsadni ko‘zlashi (zaruriyat); 3) Demokratik jamiyatda mutanosib bo‘lishi (proporsionallik)."
  },
  {
    "id": 33,
    "savol": "Favqulodda holatlarda huquqlarni cheklashning huquqiy asoslari qanday?",
    "javob": "Asoslar Konstitutsiya va 'Favqulodda holat to‘g‘risida'gi qonunda belgilanadi. Bunda davlat xavfsizligi, fuqarolar hayoti va sog‘lig‘ini himoya qilish uchun ayrim huquqlar (masalan, harakatlanish erkinligi) cheklanishi mumkin, biroq yashash, qadr-qimmat va qiynoqqa solinmaslik huquqlari mutlaqdir va hech qachon cheklanmaydi."
  },
  {
    "id": 34,
    "savol": "Huquqlarni cheklash va ularni bekor qilish o‘rtasidagi farqni tushuntiring.",
    "javob": "Cheklash — bu huquqning mavjudligini saqlab qolgan holda uning foydalanish ko‘lamini vaqtincha kamaytirishdir. Bekor qilish — huquqni huquqiy tizimdan butunlay chiqarib tashlashni anglatadi. Xalqaro huquqqa ko‘ra, insonning fundamental huquqlarini bekor qilishga yo‘l qo‘yilmaydi."
  },
  {
    "id": 35,
    "savol": "Xalqaro huquqda huquqlarni cheklashga oid normalarni tahlil qiling.",
    "javob": "Fuqarolik va siyosiy huquqlar to‘g‘risidagi xalqaro paktning 4-moddasida cheklash normalari bayon etilgan. Unga ko‘ra, cheklovlar xalqaro majburiyatlarga zid bo‘lmasligi, kamsitish xarakteriga ega bo‘lmasligi va faqat favqulodda zaruriyat holatidagina qo‘llanilishi lozim."
  },
  {
    "id": 36,
    "savol": "So‘z erkinligini cheklashning asoslari qanday?",
    "javob": "So‘z erkinligi boshqalarning huquqlari va obro‘-e’tiborini himoya qilish, milliy xavfsizlikni saqlash, jamoat tartibi, aholi salomatligi yoki ma’naviyatini asrash maqsadida qonun bilan cheklanishi mumkin."
  },
  {
    "id": 37,
    "savol": "Davlat xavfsizligi va inson huquqlari o‘rtasidagi muvozanatni izohlang.",
    "javob": "Bu muvozanat 'demokratik zaruriyat' mezoniga tayanadi. Davlat xavfsizligini ta’minlash choralari shaxsning asosiy huquqlarini butunlay yo‘qqa chiqarmasligi, aksincha, huquqlarning uzoq muddatli kafolati uchun xizmat qilishi shart."
  },
  {
    "id": 38,
    "savol": "Axloq va jamoat tartibi huquqlarni cheklashda qanday rol o‘ynaydi?",
    "javob": "Axloq va jamoat tartibi huquqlarni cheklashning qonuniy mezonlaridan biri hisoblanadi. Jamiyatda qabul qilingan umuminsoniy axloqiy normalarni saqlash va tartibsizliklarning oldini olish uchun yig‘ilishlar o‘tkazish yoki axborot tarqatish erkinligi muayyan doirada tartibga solinishi mumkin."
  },
  {
    "id": 39,
    "savol": "Huquqlarni cheklashda mutanosiblik tamoyili nimani anglatadi?",
    "javob": "Mutanosiblik (proporsionallik) tamoyili qo‘llanilayotgan cheklov chorasi ko‘zlangan maqsadga muvofiq bo‘lishini anglatadi. Ya’ni, maqsadga erishish uchun inson huquqlariga eng kam zarar yetkazadigan chorani tanlash shart."
  },
  {
    "id": 40,
    "savol": "O‘zbekiston qonunchiligida huquqlarni cheklash misollarini keltiring.",
    "javob": "Misollar: Jinoyat sodir etgan shaxsning ozodlik huquqini sud hukmi bilan cheklash; epidemiya paytida karantin choralarini qo‘llash orqali harakatlanish erkinligini cheklash; harbiy holat e’lon qilinganda yig‘ilishlar o‘tkazishni taqiqlash."
  },
  {
    "id": 41,
    "savol": "Inson huquqlarining kafolatlari tushunchasini izohlang.",
    "javob": "Inson huquqlarining kafolatlari — bu inson huquq va erkinliklarini amalga oshirish, ularni himoya qilish va buzilgan huquqlarni tiklash uchun xizmat qiladigan shart-sharoitlar, vositalar va usullar tizimidir."
  },
  {
    "id": 42,
    "savol": "Inson huquqlarining konstitutsiyaviy kafolatlari haqida ma’lumot bering.",
    "javob": "Bunga Konstitutsiyada mustahkamlangan: har bir shaxsning o'z huquqlarini sud orqali himoya qilishi, davlat organlarining qarorlari ustidan shikoyat qilishi, aybsizlik prezumpsiyasi va malakali yuridik yordam olish huquqi kabi normalar kiradi."
  },
  {
    "id": 43,
    "savol": "Sud orqali himoya qilish huquqining ahamiyati nimada?",
    "javob": "Sud orqali himoya qilish — inson huquqlarining eng samarali kafolatidir. Bu shaxsning davlat organlari, mansabdor shaxslar yoki boshqa shaxslar tomonidan buzilgan huquqlarini mustaqil va xolis sud hokimiyati orqali tiklash imkoniyatini ta'minlaydi."
  },
  {
    "id": 44,
    "savol": "Ombudsman instituti va uning vazifalarini tushuntiring.",
    "javob": "Ombudsman — bu parlament tomonidan tayinlanadigan, davlat organlari va mansabdor shaxslar tomonidan inson huquqlari to'g'risidagi qonun hujjatlariga rioya etilishini nazorat qiluvchi mustaqil vakildir. Vazifasi: shikoyatlarni ko'rib chiqish, qonunchilikni takomillashtirish va inson huquqlari bo'yicha ta'limni targ'ib qilish."
  },
  {
    "id": 45,
    "savol": "Davlat organlarining inson huquqlarini ta’minlashdagi roli qanday?",
    "javob": "Davlat organlari inson huquqlarini 'hurmat qilish' (aralashmaslik), 'himoya qilish' (uchinchi shaxslar tajovuzidan asrash) va 'amalga oshirish' (kerakli sharoitlarni yaratish) majburiyatlarini bajaradi."
  },
  {
    "id": 46,
    "savol": "Fuqarolik jamiyati institutlarining o‘rni nimada?",
    "javob": "Nodavlat notijorat tashkilotlari (NNT) va OAV jamoatchilik nazoratini o'rnatish, inson huquqlari buzilishi holatlarini aniqlash hamda aholining huquqiy savodxonligini oshirish orqali inson huquqlarini himoya qilishda muhim rol o'ynaydi."
  },
  {
    "id": 47,
    "savol": "Xalqaro himoya mexanizmlarini izohlang.",
    "javob": "Bunga BMTning Inson huquqlari bo'yicha kengashi, shartnomaviy qo'mitalar (masalan, Inson huquqlari qo'mitasi) va xalqaro sudlar (IHYeS) kiradi. Ular davlatlar hisobotlarini ko'rib chiqadi va shaxsiy shikoyatlar bo'yicha qarorlar qabul qiladi."
  },
  {
    "id": 48,
    "savol": "Inson huquqlarini buzganlik uchun javobgarlik turlari qanday?",
    "javob": "Huquqbuzarlikning xarakteriga ko'ra: intizomiy, ma'muriy, fuqaroviy-huquqiy (zararni qoplash) va jinoiy javobgarlik turlari qo'llaniladi."
  },
  {
    "id": 49,
    "savol": "Huquqiy ong va huquqiy madaniyat kafolat sifatida qanday ahamiyatga ega?",
    "javob": "Bu sub'ektiv kafolat bo'lib, inson o'z huquqlarini bilishi va ularni himoya qilishga tayyor bo'lishi, jamiyatda esa huquqqa nisbatan hurmat ruhining shakllanishi huquqlar buzilishining oldini oluvchi eng muhim omildir."
  },
  {
    "id": 50,
    "savol": "Inson huquqlarini samarali himoya qilish shartlarini baholang.",
    "javob": "Samaradorlik shartlari: sud tizimining mustaqilligi, qonun ustuvorligi, so'z erkinligi, kuchli fuqarolik jamiyati va xalqaro standartlarning milliy qonunchilikka to'liq implementatsiya qilinganligi."
  },
  {
    "id": 51,
    "savol": "Gender tengligi tushunchasini izohlang.",
    "javob": "Gender tengligi — erkaklar va ayollarning jamiyat hayotining barcha sohalarida teng huquq va imkoniyatlarga, majburiyat va mas'uliyatga ega ekanligini, jinsidan qat'i nazar teng ijtimoiy maqomga egaligini anglatadi."
  },
  {
    "id": 52,
    "savol": "Ayollar huquqlarining inson huquqlari tizimidagi o‘rnini tushuntiring.",
    "javob": "Ayollar huquqlari inson huquqlarining ajralmas qismidir. Ular ayollarning o'ziga xos fiziologik va ijtimoiy ehtiyojlarini hisobga olgan holda, jamiyatda kamsitishning har qanday shakliga barham berishga yo'naltirilgan."
  },
  {
    "id": 53,
    "savol": "O‘zbekistonda gender tengligini ta’minlashga oid qonunchilikni tahlil qiling.",
    "javob": "Asosiy hujjatlar: Konstitutsiya (58-modda), 'Xotin-qizlar va erkaklar uchun teng huquq hamda imkoniyatlar kafolatlari to'g'risida'gi qonun va 'Xotin-qizlarni tazyiq va zo'ravonlikdan himoya qilish to'g'risida'gi qonun."
  },
  {
    "id": 54,
    "savol": "Gender tengsizligining asosiy sabablari nimalardan iborat?",
    "javob": "Sabablar: eskirgan ijtimoiy stereotiplar, patriarhal an'analar, ayollarning uy mehnatiga ko'p vaqt sarflashi, ta'lim va iqtisodiy resurslardan foydalanishdagi nomutanosiblik."
  },
  {
    "id": 55,
    "savol": "Ayollarning mehnat huquqlari qanday kafolatlanadi?",
    "javob": "Mehnat kodeksiga ko'ra: ishga qabul qilishda jins bo'yicha kamsitishni taqiqlash, homilador yoki yosh bolasi bor ayollar uchun imtiyozlar, teng mehnat uchun teng ish haqi olish va mehnatni muhofaza qilish bo'yicha maxsus normalar orqali."
  },
  {
    "id": 56,
    "savol": "Siyosiy jarayonlarda ayollarning ishtiroki qanday ahamiyatga ega?",
    "javob": "Ayollarning qarorlar qabul qilish darajasidagi ishtiroki jamiyatda ijtimoiy adolatni ta'minlaydi, xotin-qizlarning o'ziga xos muammolarini davlat darajasida ko'tarish imkonini beradi va boshqaruv samaradorligini oshiradi."
  },
  {
    "id": 57,
    "savol": "Gender tengligi ijtimoiy jamiyat hayotiga qanday ta’sir ko‘rsatadi?",
    "javob": "Ijobiy ta'sirlar: iqtisodiy o'sish (ayollarning mehnat bozoridagi ishtiroki hisobiga), qashshoqlikning kamayishi, bolalar tarbiyasi va salomatligi darajasining yuksalishi."
  },
  {
    "id": 58,
    "savol": "Xalqaro hujjatlarda gender tengligi masalasi qanday yoritilgan?",
    "javob": "Asosiy hujjat — 1979-yildagi 'Ayollarga nisbatan kamsitishning barcha shakllariga barham berish to'g'risida'gi konvensiya (CEDAW). Shuningdek, BMT Barqaror rivojlanish maqsadlarining 5-maqsadi bevosita gender tengligiga bag'ishlangan."
  },
  {
    "id": 59,
    "savol": "Gender tengligini ta’minlashda davlat va jamiyat roli qanday?",
    "javob": "Davlat huquqiy bazani yaratadi va kvotalar joriy etadi; jamiyat esa stereotiplarga qarshi kurashish, oilada tenglikni targ'ib qilish va ayollarning tashabbuslarini qo'llab-quvvatlash orqali hissa qo'shadi."
  },
  {
    "id": 60,
    "savol": "Gender tengligini ta’minlash istiqbollarini baholang.",
    "javob": "Istiqbollar: barcha sohalarda ayollar ulushini oshirish (kamida 30%), 'gender budjetlashtirish' tizimini joriy etish, zo'ravonlikka nisbatan murosasiz muhitni yaratish va ayollarning raqamli savodxonligini oshirish."
  },
  {
    "id": 61,
    "savol": "Inson huquqlari bo‘yicha xalqaro huquq tushunchasini izohlang.",
    "javob": "Inson huquqlari bo‘yicha xalqaro huquq — bu davlatlararo kelishuvlar asosida inson qadr-qimmati va asosiy erkinliklarini himoya qilish, ularning universal standartlarini o‘rnatishga qaratilgan xalqaro ommaviy huquqning maxsus tarmog‘idir."
  },
  {
    "id": 62,
    "savol": "BMTning inson huquqlari sohasidagi asosiy hujjatlarini sanab bering.",
    "javob": "Asosiy hujjatlar: 1) Inson huquqlari umumjahon deklaratsiyasi; 2) Fuqarolik va siyosiy huquqlar to‘g‘risidagi xalqaro pakt; 3) Iqtisodiy, ijtimoiy va madaniy huquqlar to‘g‘risidagi xalqaro pakt; 4) Bolalar huquqlari to‘g‘risidagi konvensiya; 5) Ayollarga nisbatan kamsitishning barcha shakllariga barham berish to‘g‘risidagi konvensiya."
  },
  {
    "id": 63,
    "savol": "Inson huquqlari umumjahon deklaratsiyasining ahamiyati nimada?",
    "javob": "Deklaratsiya insoniyat tarixida birinchi marta barcha insonlarga tegishli bo‘lgan fundamental huquqlarni universal darajada e’lon qildi. U majburiy xalqaro shartnomalar uchun axloqiy va huquqiy poydevor bo‘lib, ko‘plab davlatlar Konstitutsiyalariga asos qilib olingan."
  },
  {
    "id": 64,
    "savol": "Xalqaro paktlarning huquqiy kuchini tushuntiring.",
    "javob": "Xalqaro paktlar (1966-yil) yuridik jihatdan majburiy kuchga ega xalqaro shartnomalardir. Ularni ratifikatsiya qilgan davlatlar o‘z milliy qonunchiligini ushbu hujjatlarga muvofiqlashtirish va ularning ijrosi bo‘yicha BMT qo‘mitalariga muntazam hisobot berish majburiyatini oladilar."
  },
  {
    "id": 65,
    "savol": "Mintaqaviy inson huquqlari tizimlarini solishtiring.",
    "javob": "Mintaqaviy tizimlar (Yevropa, Amerika, Afrika) xalqaro standartlarni muayyan geografik hududdagi madaniy va siyosiy xususiyatlarga moslashtiradi. Yevropa tizimi (IHYeS) sud qarorlarining majburiyligi va shikoyat mexanizmining samaradorligi bilan eng rivojlangan tizim hisoblanadi."
  },
  {
    "id": 66,
    "savol": "O‘zbekistonning xalqaro majburiyatlari nimalardan iborat?",
    "javob": "O‘zbekiston ratifikatsiya qilgan 80 dan ortiq xalqaro inson huquqlari hujjatlariga rioya qilish, inson huquqlari bo‘yicha milliy ma’ruzalarni xalqaro tashkilotlarga taqdim etish va xalqaro ekspertlarning tavsiyalarini milliy qonunchilikka implementatsiya qilish majburiyatini olgan."
  },
  {
    "id": 67,
    "savol": "Xalqaro monitoring mexanizmlari qanday ishlaydi?",
    "javob": "Monitoring ikki xil usulda amalga oshiriladi: 1) Shartnomaviy qo‘mitalar (davlat hisobotlarini ko‘rib chiqish); 2) BMT Inson huquqlari kengashining Universal davriy sharhi (har 4-5 yilda barcha davlatlarning inson huquqlari holatini tahlil qilish)."
  },
  {
    "id": 68,
    "savol": "Davlat suvereniteti va inson huquqlari o‘rtasidagi nisbatni tahlil qiling.",
    "javob": "Zamonaviy xalqaro huquqda inson huquqlari faqat davlatning ichki ishi emas. Davlat suvereniteti inson huquqlarini buzish uchun qalqon bo‘la olmaydi; inson huquqlarining qo‘pol buzilishi xalqaro hamjamiyatning qonuniy aralashuviga (gumanitar intervensiya yoki sanksiyalar) asos bo‘lishi mumkin."
  },
  {
    "id": 69,
    "savol": "Xalqaro va milliy huquq o‘rtasidagi uyg‘unlikni tushuntiring.",
    "javob": "Bu uyg‘unlik implementatsiya (xalqaro normani milliy qonunga kiritish) orqali erishiladi. O‘zbekiston Konstitutsiyasiga ko‘ra, inson huquqlari bo‘yicha xalqaro huquqning umume’tirof etilgan prinsiplari va normalari milliy huquqiy tizimning tarkibiy qismi va ustuvor manbai hisoblanadi."
  },
  {
    "id": 70,
    "savol": "Globallashuv sharoitida xalqaro inson huquqlarining roli qanday?",
    "javob": "Globallashuv inson huquqlarini himoya qilishning yagona dunyoviy standartlarini talab qiladi. U transmilliy korporatsiyalar javobgarligi, kiber-huquqlar va global migratsiya kabi masalalarda inson huquqlarini xalqaro nazorat qilish rolini kuchaytiradi."
  },
  {
    "id": 71,
    "savol": "Fuqarolik jamiyati tushunchasini izohlang.",
    "javob": "Fuqarolik jamiyati — davlatdan mustaqil bo‘lgan, fuqarolarning o‘z tashabbuslari va manfaatlari asosida shakllangan ijtimoiy munosabatlar, institutlar va tashkilotlar majmuidir."
  },
  {
    "id": 72,
    "savol": "Fuqarolik jamiyatining asosiy institutlarini sanab bering.",
    "javob": "Institutlar: nodavlat notijorat tashkilotlari (NNT), siyosiy partiyalar, ommaviy axborot vositalari, kasaba uyushmalari, diniy tashkilotlar, mahalla va o‘zini o‘zi boshqarish organlari."
  },
  {
    "id": 73,
    "savol": "Fuqarolik jamiyatida inson huquqlarining o‘rni qanday?",
    "javob": "Inson huquqlari fuqarolik jamiyatining hayotiy asosi hisoblanadi. Faqat erkin shaxs va uning himoyalangan huquqlari mavjud bo‘lgan joyda fuqarolik jamiyati rivojlanadi; ayni paytda fuqarolik jamiyati bu huquqlarning himoyachisi sifatida chiqadi."
  },
  {
    "id": 74,
    "savol": "Nodavlat notijorat tashkilotlarining inson huquqlarini himoya qilishdagi roli nimada?",
    "javob": "NNTlar inson huquqlari buzilishini aniqlaydi, jabrlanganlarga bepul yuridik yordam beradi, davlat organlariga hisobotlar taqdim etadi va qonunchilikni takomillashtirish bo‘yicha jamoatchilik tashabbuslarini ilgari suradi."
  },
  {
    "id": 75,
    "savol": "OAVning inson huquqlarini ta’minlashdagi ahamiyatini tushuntiring.",
    "javob": "OAV — 'to‘rtinchi hokimiyat' sifatida inson huquqlari buzilishi holatlarini ochiqlaydi, jamoatchilik fikrini shakllantiradi va davlat organlari faoliyatining shaffofligini ta’minlash orqali profilaktik rol o‘ynaydi."
  },
  {
    "id": 76,
    "savol": "Fuqarolik jamiyati va huquqiy davlat o‘rtasidagi bog‘liqlikni tahlil qiling.",
    "javob": "Ular bir-birini taqozo etadi: huquqiy davlat fuqarolik jamiyati uchun erkinlik muhitini yaratadi, fuqarolik jamiyati esa davlatning huquq doirasidan chiqib ketmasligini jamoatchilik nazorati orqali nazorat qiladi."
  },
  {
    "id": 77,
    "savol": "Jamoatchilik nazorati tushunchasi va uning ahamiyati nimada?",
    "javob": "Jamoatchilik nazorati — fuqarolik jamiyati sub’yektlari tomonidan davlat organlarining inson huquqlariga oid qonun hujjatlarini ijro etishini kuzatish va baholash jarayonidir. U korrupsiyani kamaytirish va boshqaruv sifatini oshirishga xizmat qiladi."
  },
  {
    "id": 78,
    "savol": "Fuqarolik jamiyati shakllanishiga ta’sir etuvchi omillarni izohlang.",
    "javob": "Asosiy omillar: xususiy mulkning mavjudligi, demokratik siyosiy tizim, yuqori darajadagi huquqiy ong, so‘z va birlashish erkinligi hamda iqtisodiy barqarorlik."
  },
  {
    "id": 79,
    "savol": "O‘zbekistonda fuqarolik jamiyatini rivojlantirish yo‘nalishlarini baholang.",
    "javob": "Yo‘nalishlar: NNTlarni davlat tomonidan qo‘llab-quvvatlash (subsidiyalar, grantlar), 'Mahalla' institutini kuchaytirish, davlat organlari huzurida jamoatchilik kengashlarini tuzish va ijtimoiy sheriklik tizimini kengaytirish."
  },
  {
    "id": 80,
    "savol": "Fuqarolik jamiyatining inson huquqlari kafolatlashdagi istiqbollari qanday?",
    "javob": "Istiqbollar: raqamli fuqarolik faolligini oshirish, davlat xizmatlari ustidan monitoringni to‘liq jamoatchilikka berish va inson huquqlari bo‘yicha mustaqil 'soya hisobotlar' (shadow reports) tayyorlash tizimini professional darajaga ko‘tarish."
  },
  {
    "id": 81,
    "savol": "Davlat hokimiyati organlarining inson huquqlarini ta’minlashdagi majburiyatlari nimalardan iborat?",
    "javob": "Davlatning uchta asosiy majburiyati bor: 1) Hurmat qilish (davlat shaxs erkinligiga asossiz aralashmasligi); 2) Himoya qilish (uchinchi shaxslar tomonidan huquqlar buzilishiga yo‘l qo‘ymaslik); 3) Ta’minlash (huquqlarni amalga oshirish uchun zaruriy iqtisodiy, ijtimoiy va huquqiy sharoitlarni yaratish)."
  },
  {
    "id": 82,
    "savol": "Qonun chiqaruvchi hokimiyatning inson huquqlari sohasidagi roli qanday?",
    "javob": "Parlament inson huquqlari standartlarini milliy qonunchilik darajasida mustahkamlaydi, xalqaro shartnomalarni ratifikatsiya qiladi va inson huquqlariga oid qonunlar ijrosini nazorat qilish orqali huquqiy baza yaratadi."
  },
  {
    "id": 83,
    "savol": "Ijro etuvchi hokimiyat faoliyatida inson huquqlarining ta’minlanishini tushuntiring.",
    "javob": "Vazirlar Mahkamasi va barcha vazirliklar qonunlarni amaliyotga tatbiq etish, ijtimoiy dasturlarni moliyalashtirish, sog‘liqni saqlash, ta’lim va xavfsizlik kabi sohalarda huquqlarni bevosita amalga oshirish uchun mas’uldir."
  },
  {
    "id": 84,
    "savol": "Sud hokimiyatining inson huquqlarini himoya qilishdagi o‘rni nimada?",
    "javob": "Sud hokimiyati inson huquqlarining so‘nggi va eng kuchli himoyachisidir. U buzilgan huquqlarni tiklaydi, aybdorlarni jazolaydi va davlat organlarining qonunga xilof hujjatlarini bekor qilish orqali adolatni ta’minlaydi."
  },
  {
    "id": 85,
    "savol": "Huquqni muhofaza qiluvchi organlar va inson huquqlari o‘rtasidagi munosabatni tahlil qiling.",
    "javob": "Ular jamiyatda tartib va qonuniylikni ta’minlash orqali inson huquqlarini himoya qiladi. Shu bilan birga, ularning faoliyati (ushlab turish, tintuv) inson erkinligini bevosita cheklashi mumkinligi sababli, ular qat’iy qonun doirasida harakat qilishlari shart."
  },
  {
    "id": 86,
    "savol": "Mansabdor shaxslarning huquq va erkinliklarni buzganlik uchun javobgarligi qanday?",
    "javob": "Mansabdor shaxslar o‘z vakolatini suiiste’mol qilganlik yoki xizmatga sovuqqonlik bilan qarash natijasida inson huquqlarini buzsa, intizomiy, ma’muriy va og‘ir hollarda (qiynoq, noqonuniy qamoq) jinoiy javobgarlikka tortiladi."
  },
  {
    "id": 87,
    "savol": "Davlat boshqaruvida ochiqlik va shaffoflik tamoyilining ahamiyati nimada?",
    "javob": "Ochiqlik korrupsiyani oldini oladi, fuqarolarning axborot olish huquqini ta’minlaydi va jamoatchilik nazorati orqali davlat organlarining inson huquqlari oldidagi mas’uliyatini oshiradi."
  },
  {
    "id": 88,
    "savol": "Inson huquqlarini ta’minlashda ma’muriy islohotlarning roli qanday?",
    "javob": "Ma’muriy islohotlar (ixcham davlat apparati, byurokratiyani kamaytirish) davlat xizmatlari sifatini oshiradi, sansalorlikka barham beradi va shaxsning davlat bilan muloqotini osonlashtirib, uning huquqiy maqomini mustahkamlaydi."
  },
  {
    "id": 89,
    "savol": "O‘zbekistonda davlat hokimiyati organlari faoliyatini inson huquqlari nuqtai nazaridan baholang.",
    "javob": "So‘nggi yillarda 'Habeas corpus' institutining kengayishi, propiska tizimining bekor qilinishi va virtual qabulxonalar orqali davlat organlarining xalqqa yaqinlashishi inson huquqlari himoyasini yangi bosqichga ko‘tardi."
  },
  {
    "id": 90,
    "savol": "Davlat hokimiyati va shaxs manfaatlari o‘rtasidagi muvozanatni tushuntiring.",
    "javob": "Bu muvozanat 'hokimiyatning bo‘linishi' va 'huquq ustuvorligi' orqali ta’minlanadi. Davlat o‘z vazifasini bajarishda shaxsning shaxsiy daxlsizligiga faqat qonuniy asosda va zaruriy miqdorda aralashishi lozim."
  },
  {
    "id": 91,
    "savol": "Hozirgi davrda inson huquqlari sohasidagi global muammolarni sanab bering.",
    "javob": "Global muammolar: qurolli mojarolar va qochqinlar inqirozi, iqlim o‘zgarishi, ekstremizm va terrorizm, raqamli kuzatuv (privatlikning buzilishi) va oziq-ovqat xavfsizligi."
  },
  {
    "id": 92,
    "savol": "Globallashuv inson huquqlariga qanday ta’sir ko‘rsatmoqda?",
    "javob": "Ijobiy: inson huquqlari bo‘yicha global nazorat va axborot almashinuvi kuchaydi. Salbiy: milliy madaniy o‘ziga xosliklarning yo‘qolishi va global iqtisodiy inqirozlarning shaxsiy farovonlikka zarbasi."
  },
  {
    "id": 93,
    "savol": "Raqamli texnologiyalar va inson huquqlari o‘rtasidagi munosabatni tahlil qiling.",
    "javob": "Raqamli huquqlar yangi avlod huquqlari sifatida shakllanmoqda. Bu shaxsiy ma’lumotlarni himoya qilish, internetga ulanish huquqi va 'unutilish huquqi' kabi masalalarni qamrab oladi."
  },
  {
    "id": 94,
    "savol": "Migratsiya jarayonlarining inson huquqlariga ta’siri nimada?",
    "javob": "Migratsiya insonning harakatlanish va yaxshi mehnat sharoitiga intilish huquqini ifodalaydi, biroq migrantlarning huquqiy himoyasizligi, kamsitilishi va odam savdosiga duchor bo‘lish xavfini oshiradi."
  },
  {
    "id": 95,
    "savol": "Ekologik muammolar va inson huquqlari o‘rtasidagi bog‘liqlikni tushuntiring.",
    "javob": "Insonning yashash huquqi bevosita sog‘lom atrof-muhit huquqi bilan bog‘liq. Atrof-muhitning ifloslanishi inson salomatligiga putur yetkazadi va kelajak avlodlar huquqlarini cheklaydi."
  },
  {
    "id": 96,
    "savol": "Ijtimoiy tengsizlik inson huquqlarining amalga oshishiga qanday ta’sir qiladi?",
    "javob": "Boy va kambag‘allar o‘rtasidagi katta farq ta’lim va sifatli tibbiy xizmat olishda tengsizlikni keltirib chiqaradi, bu esa amalda inson huquqlarining hamma uchun barobar ekanligi tamoyiliga zid keladi."
  },
  {
    "id": 97,
    "savol": "Inson huquqlari ta’minlashda ta’lim va ma’rifatning roli nimada?",
    "javob": "Huquqiy ta’lim shaxsga o‘z huquqlarini tanish va ularni talab qilish imkonini beradi. Ma’rifatli jamiyatda huquqbuzarliklarga nisbatan murosasizlik shakllanadi va davlat o‘zboshimchaligi kamayadi."
  },
  {
    "id": 98,
    "savol": "Yoshlar huquqlarini ta’minlashdagi dolzarb masalalarni izohlang.",
    "javob": "Yoshlar uchun sifatli zamonaviy ta’lim olish, birinchi ish joyiga ega bo‘lish, qarorlar qabul qilishda ishtirok etish va raqamli iqtisodiyotda o‘z o‘rnini topish bugungi kunning eng dolzarb masalalari hisoblanadi."
  },
  {
    "id": 99,
    "savol": "Kelajakda inson huquqlarini himoya qilishning ustuvor yo‘nalishlari qanday?",
    "javob": "Ustuvor yo‘nalishlar: sun’iy intellekt etikasini tartibga solish, bioetika va genetik huquqlar, ekologik xavfsizlik va global raqamli tenglikni ta’minlash."
  },
  {
    "id": 100,
    "savol": "O‘zbekistonda inson huquqlari sohasidagi istiqbolli islohotlarni baholang.",
    "javob": "Istiqbollar: Inson huquqlari bo‘yicha milliy strategiyani amalga oshirishni davom ettirish, qamoqxona tizimini to‘liq reabilitatsiya modeliga o‘tkazish va barcha sohalarda gender tengligi hamda inklyuzivlikni ta’minlash."
  },
  {
    "id": 101,
    "savol": "Inson huquqlari tushunchasi hamda uning tasniflanishi haqida ma’lumot bering.",
    "javob": "Inson huquqlari — har bir odamga o'z tabiati va qadr-qimmati tufayli tegishli bo'lgan imkoniyatlar majmuidir. Tasniflanishi: 1) paydo bo'lishiga ko'ra (avlodlar); 2) ijtimoiy sohalarga ko'ra (shaxsiy, siyosiy, iqtisodiy, ijtimoiy, madaniy); 3) amalga oshirishga ko'ra (individual va jamoaviy)."
  },
  {
    "id": 102,
    "savol": "Inson huquqlarining paydo bo‘lishiga qanday tarixiy omillar ta’sir ko‘rsatgan?",
    "javob": "Antik davr falsafasi, dinlardagi tenglik g'oyalari, o'rta asrlardagi ozodlik xartiyalari, burjua inqiloblari (AQSH Mustaqillik deklaratsiyasi, Fransiya Inson huquqlari deklaratsiyasi) hamda Ikkinchi jahon urushidan keyingi global talofatlar asosiy tarixiy omillar bo'lgan."
  },
  {
    "id": 103,
    "savol": "Inson huquqlarining asosiy xususiyatlari qaysilar?",
    "javob": "Asosiy xususiyatlari: 1) Universallik (hamma uchun); 2) Ajralmaslik (voz kechib bo'lmaslik); 3) Bo'linmaslik (bir huquq boshqasidan muhim emas); 4) O'zaro bog'liqlik; 5) Inson qadr-qimmati bilan uzviylik."
  },
  {
    "id": 104,
    "savol": "Tabiiy huquqlar nazariyasining mazmunini tushuntirib bering.",
    "javob": "Ushbu nazariyaga ko'ra, inson huquqlari davlat tomonidan berilmaydi, balki inson tug'ilishi bilanoq tabiatdan unga tegishli bo'ladi (masalan, yashash, erkinlik). Davlatning vazifasi bu huquqlarni berish emas, balki ularni tan olish va himoya qilishdir."
  },
  {
    "id": 105,
    "savol": "Inson huquq va majburiyatlari tushunchasi haqida ma’lumot bering.",
    "javob": "Inson huquqlari — bu shaxsning davlatdan talab qilishi mumkin bo'lgan erkinliklari. Majburiyatlar esa — shaxsning boshqalar huquqini hurmat qilishi va jamiyat oldidagi burchidir. Huquq va majburiyatlar mutanosibligi ijtimoiy adolatni ta'minlaydi."
  },
  {
    "id": 106,
    "savol": "Inson huquqlarining universalligi deganda nima tushuniladi?",
    "javob": "Universallik — inson huquqlarining dunyoning qayerida bo'lishidan, irqi, jinsi, tili, dini yoki siyosiy qarashlaridan qat'i nazar, barcha odamlar uchun bir xil darajada va amal qilishi tushuniladi."
  },
  {
    "id": 107,
    "savol": "Inson huquqlarining bo‘linmasligi tamoyili nimani anglatadi?",
    "javob": "Bo'linmaslik tamoyiliga ko'ra, huquqlar o'rtasida ierarxiya (pog'onalar) yo'q. Fuqarolik va siyosiy huquqlarni iqtisodiy yoki ijtimoiy huquqlarsiz to'liq amalga oshirib bo'lmaydi va aksincha. Ularning barchasi teng darajada ahamiyatli."
  },
  {
    "id": 108,
    "savol": "Inson huquqlari va fuqaro huquqlari o‘rtasidagi farqni izohlang.",
    "javob": "Inson huquqlari — dunyodagi barcha odamlarga tegishli (masalan, yashash huquqi). Fuqaro huquqlari — faqat muayyan davlat fuqaroligiga ega shaxslarga tegishli bo'lgan siyosiy va huquqiy imkoniyatlardir (masalan, saylash huquqi)."
  },
  {
    "id": 109,
    "savol": "Inson huquqlari va erkinliklari o‘rtasida qanday bog‘liqlik va farqlar mavjud?",
    "javob": "Huquq ko'pincha davlatdan muayyan harakatni (masalan, ta'lim berishni) talab qilishni anglatsa, erkinlik davlatning shaxsiy sohaga aralashmasligini (masalan, e'tiqod erkinligi) bildiradi. Ikkalasi ham shaxs mustaqilligini ta'minlashga xizmat qiladi."
  },
  {
    "id": 110,
    "savol": "Inson huquqlarining tasnifini tushuntirib bering.",
    "javob": "Huquqlar mazmuniga ko'ra 5 guruhga bo'linadi: 1) Shaxsiy (hayot, qadr-qimmat); 2) Siyosiy (saylov, birlashish); 3) Iqtisodiy (mulk, mehnat); 4) Ijtimoiy (sog'liq, uy-joy); 5) Madaniy (ta'lim, ijod erkinligi)."
  },
  {
    "id": 111,
    "savol": "Birinchi avlod inson huquqlariga qaysi huquqlar kiradi?",
    "javob": "Birinchi avlod — bu fuqarolik (shaxsiy) va siyosiy huquqlardir. Ular XVIII asr inqiloblari davrida shakllangan bo'lib, insonni davlat o'zboshimchaligidan himoya qilishga qaratilgan (so'z erkinligi, shaxsiy daxlsizlik va b.)."
  },
  {
    "id": 112,
    "savol": "Ikkinchi avlod inson huquqlarining mazmuni nimadan iborat?",
    "javob": "Ikkinchi avlod — iqtisodiy, ijtimoiy va madaniy huquqlardir. Ular XIX-XX asr boshlarida shakllangan bo'lib, davlatdan inson farovonligi uchun ijobiy harakatlarni (ish bilan ta'minlash, ijtimoiy himoya) amalga oshirishni talab qiladi."
  },
  {
    "id": 113,
    "savol": "Uchinchi avlod inson huquqlariga qanday huquqlar mansub?",
    "javob": "Uchinchi avlod — birdamlik (kollektiv) huquqlari. Bunga tinchlik huquqi, sog'lom atrof-muhit huquqi, xalqlarning o'z taqdirini o'zi belgilash huquqi va taraqqiyot huquqi kiradi."
  },
  {
    "id": 114,
    "savol": "Fuqarolik va siyosiy huquqlar tushunchasini izohlang.",
    "javob": "Bu huquqlar insonning jismoniy daxlsizligini va davlat boshqaruvida ishtirokini ta'minlaydi. Ularning asosiy maqsadi — shaxs erkinligini kafolatlash va demokratik siyosiy tizimni shakllantirishdir."
  },
  {
    "id": 115,
    "savol": "Ijtimoiy-iqtisodiy huquqlar nima?",
    "javob": "Bu insonning munosib turmush darajasini ta'minlovchi huquqlar: mulkdor bo'lish, mehnat qilish, dam olish, ijtimoiy ta'minot va uy-joyga ega bo'lish huquqlaridir."
  },
  {
    "id": 116,
    "savol": "Madaniy huquqlarning asosiy jihatlari qaysilar?",
    "javob": "Bunga ta'lim olish, jamiyatning madaniy hayotida ishtirok etish, ilmiy taraqqiyot natijalaridan foydalanish hamda ilmiy, adabiy va badiiy ijod erkinligi kiradi."
  },
  {
    "id": 117,
    "savol": "Shaxsiy huquqlar deganda nima tushuniladi?",
    "javob": "Shaxsiy (fuqarolik) huquqlar — bu insonning tug'ma va ajralmas huquqlari bo'lib, shaxsning hayoti, erkinligi, qadr-qimmati va shaxsiy hayoti daxlsizligini har qanday tajovuzdan himoya qiladi."
  },
  {
    "id": 118,
    "savol": "Siyosiy huquqlarning jamiyatdagi ahamiyati nimada?",
    "javob": "Siyosiy huquqlar fuqarolarga davlat hokimiyatini shakllantirish va uning faoliyatini nazorat qilish imkonini beradi. Busiz jamiyatda demokratiya va hisobdorlik mavjud bo'lmaydi."
  },
  {
    "id": 119,
    "savol": "Insonning yashash huquqi qanday huquq hisoblanadi?",
    "javob": "Yashash huquqi — eng oliy va fundamental shaxsiy huquqdir. U boshqa barcha huquqlarning asosi bo'lib, davlat zimmasiga inson hayotini himoya qilish va o'lim jazosini bekor qilish majburiyatini yuklaydi."
  },
  {
    "id": 120,
    "savol": "Qiynoqlardan ozod bo‘lish huquqining mazmuni nimadan iborat?",
    "javob": "Bu mutlaq huquq bo'lib, hech qanday holatda (hatto urush yoki favqulodda holatda ham) cheklanmaydi. U insonni shafqatsiz, g'ayriinsoniy yoki qadr-qimmatni kamsituvchi muomaladan va qiynoqlardan himoya qiladi."
  },
  {
    "id": 121,
    "savol": "Inson huquqlarini cheklash mumkin bo‘lgan holatlar qaysilar?",
    "javob": "Inson huquqlari faqat qonun bilan belgilangan holda, boshqalarning huquqlarini, jamoat tartibini, davlat xavfsizligini, aholi salomatligi va ma'naviyatini himoya qilish maqsadida zarur bo'lgan doirada cheklanishi mumkin."
  },
  {
    "id": 122,
    "savol": "Favqulodda holatlarda inson huquqlarining cheklanishi qanday amalga oshiriladi?",
    "javob": "Favqulodda holat davrida ayrim huquqlar vaqtinchalik cheklanishi mumkin, biroq bu cheklovlar xalqaro majburiyatlarga zid bo'lmasligi, kamsitish xarakteriga ega bo'lmasligi va mutlaq huquqlarga daxl qilmasligi shart."
  },
  {
    "id": 123,
    "savol": "Mutlaq huquqlar deganda nima tushuniladi?",
    "javob": "Har qanday sharoitda (urush, favqulodda holat) cheklanishi mutlaqo taqiqlangan huquqlar. Bunga yashash huquqi, qiynoqlarga solinmaslik, qul qilinmaslik va fikrlash erkinligi kiradi."
  },
  {
    "id": 124,
    "savol": "Nisbiy huquqlar tushunchasini izohlang.",
    "javob": "Muayyan qonuniy maqsadlar (masalan, jamoat xavfsizligi) yo'lida cheklanishi mumkin bo'lgan huquqlar. Masalan, harakatlanish erkinligi, yig'ilishlar o'tkazish yoki so'z erkinligi nisbiy huquqlardir."
  },
  {
    "id": 125,
    "savol": "Kamsitmaslik tamoyilining mazmuni nimadan iborat?",
    "javob": "Har qanday shaxsning irqi, jinsi, tili, dini, siyosiy qarashlari yoki ijtimoiy kelib chiqishidan qat'i nazar, barcha inson huquqlaridan teng foydalanishini ta'minlash va asossiz tafovutlarga yo'l qo'ymaslikdir."
  },
  {
    "id": 126,
    "savol": "Tenglik huquqi qanday ta’minlanadi?",
    "javob": "Tenglik huquqi qonun oldida barchaning baravarligi (formal tenglik) va barcha uchun hayotda teng imkoniyatlar yaratish (real tenglik) orqali, shuningdek kamsitish uchun javobgarlik belgilash orqali ta'minlanadi."
  },
  {
    "id": 127,
    "savol": "Davlatning inson huquqlarini hurmat qilish majburiyati nimadan iborat?",
    "javob": "Bu negativ majburiyat bo'lib, davlat organlari va mansabdor shaxslarning inson huquqlari va erkinliklaridan foydalanish jarayoniga asossiz aralashmasliklarini anglatadi."
  },
  {
    "id": 128,
    "savol": "Davlatning inson huquqlarini himoya qilish majburiyatlari qaysilar?",
    "javob": "Davlat inson huquqlari uchinchi shaxslar (xususiy shaxslar yoki tashkilotlar) tomonidan buzilishining oldini olishi, huquqbuzarlarni jazolashi va jabrlanganlarga yordam berishi shart."
  },
  {
    "id": 129,
    "savol": "Sud hokimiyatining inson huquqlarini ta’minlashdagi roli qanday?",
    "javob": "Sud inson huquqlarining asosiy kafolati hisoblanadi. U mustaqil va xolis sub'ekt sifatida buzilgan huquqlarni tiklaydi, nizolarni qonun asosida hal qiladi va ijro hokimiyati ustidan huquqiy nazoratni amalga oshiradi."
  },
  {
    "id": 130,
    "savol": "Ombudsman institutining vazifalari nimalardan iborat?",
    "javob": "Inson huquqlari bo'yicha vakil davlat organlari tomonidan inson huquqlari buzilishini tekshiradi, fuqarolar shikoyatlarini ko'rib chiqadi, qonunchilikni takomillashtirish va inson huquqlari madaniyatini yuksaltirishga xizmat qiladi."
  },
  {
    "id": 131,
    "savol": "Inson huquqlarining xalqaro himoyasi deganda nima tushuniladi?",
    "javob": "Bu milliy darajada himoya qilinmagan yoki buzilgan huquqlarni xalqaro shartnomalar, tashkilotlar (BMT) va sudlar orqali himoya qilishning qo'shimcha mexanizmlari tizimidir."
  },
  {
    "id": 132,
    "savol": "Inson huquqlari umumjahon deklaratsiyasining ahamiyati nimada?",
    "javob": "Deklaratsiya insoniyat tarixida ilk bor inson huquqlarining universal standartlarini belgilab bergan poydevor hujjatdir. U zamonaviy inson huquqlari tizimining 'Konstitutsiyasi' sanaladi."
  },
  {
    "id": 133,
    "savol": "1948-yilgi Inson huquqlari umumjahon deklaratsiyasining asosiy g‘oyalari qaysilar?",
    "javob": "Barcha odamlar erkin, qadr-qimmat va huquqlarda teng bo'lib tug'ilishi; yashash, erkinlik va shaxsiy daxlsizlikning daxlsizligi; kamsitmaslik va adolatli sudlov g'oyalaridir."
  },
  {
    "id": 134,
    "savol": "Fuqarolik va siyosiy huquqlar to‘g‘risidagi xalqaro pakt nimani belgilaydi?",
    "javob": "Bu hujjat davlatlar uchun yuridik majburiyat yaratadi. U yashash, erkinlik, so'z erkinligi, saylash va saylanish kabi 'birinchi avlod' huquqlarini himoya qilish mexanizmlarini belgilaydi."
  },
  {
    "id": 135,
    "savol": "Iqtisodiy, ijtimoiy va madaniy huquqlar to‘g‘risidagi xalqaro pakt mazmuni nimadan iborat?",
    "javob": "Ushbu pakt munosib hayot darajasini ta'minlashga qaratilgan bo'lib, mehnat qilish, sog'liqni saqlash, ta'lim olish va ijtimoiy ta'minot huquqlarini mustahkamlaydi."
  },
  {
    "id": 136,
    "savol": "BMTning inson huquqlari sohasidagi asosiy organlari qaysilar?",
    "javob": "Asosiy organlar: BMT Inson huquqlari bo'yicha Kengashi, Inson huquqlari bo'yicha Oliy komissar boshqarmasi va shartnomaviy qo'mitalar (masalan, Inson huquqlari qo'mitasi)."
  },
  {
    "id": 137,
    "savol": "Inson huquqlari bo‘yicha Kengashning vazifalari nimalardan iborat?",
    "javob": "Kengash dunyo bo'ylab inson huquqlari holatini monitoring qiladi (Universal davriy sharh), inson huquqlari buzilishiga munosabat bildiradi va yangi xalqaro standartlarni ishlab chiqadi."
  },
  {
    "id": 138,
    "savol": "Inson huquqlari bo‘yicha shikoyat mexanizmlari deganda nima tushuniladi?",
    "javob": "Shaxs yoki guruhlarning buzilgan huquqlari bo'yicha xalqaro shartnomaviy organlarga (qo'mitalarga) murojaat qilish va ushbu murojaatlarni xalqaro huquq normalari asosida ko'rib chiqish tartibidir."
  },
  {
    "id": 139,
    "savol": "Inson huquqlarini xalqaro darajada himoya qilish mexanizmlari qaysilar?",
    "javob": "1) Nizomiy mexanizmlar (BMT Kengashi, Maxsus ma'ruzachilar); 2) Shartnomaviy mexanizmlar (Qo'mitalar); 3) Xalqaro sud mexanizmlari (IHYeS va b.)."
  },
  {
    "id": 140,
    "savol": "Mintaqaviy inson huquqlari tizimlariga misollar keltiring.",
    "javob": "Yevropa tizimi (Yevropa Kengashi va IHYeS), Amerika tizimi (Amerika davlatlari tashkiloti) va Afrika tizimi (Afrika Ittifoqi) mintaqaviy tizimlarning eng yorqin misollaridir."
  },
  {
    "id": 141,
    "savol": "Yevropa inson huquqlari tizimining o‘ziga xos jihatlari nimada?",
    "javob": "Yevropa tizimi eng samarali mintaqaviy model bo'lib, uning asosi Inson huquqlari bo'yicha Yevropa sudi (IHYeS) hisoblanadi. Uning o'ziga xosligi — jismoniy shaxslarning davlat ustidan to'g'ridan-to'g'ri shikoyat qilish imkoniyati va sud qarorlarining barcha a'zo davlatlar uchun majburiyligidadir."
  },
  {
    "id": 142,
    "savol": "Afrika inson va xalqlar huquqlari tizimi qanday tashkil etilgan?",
    "javob": "Ushbu tizim 1981-yildagi Afrika xartiyasiga asoslanadi. Uning o'ziga xosligi individual huquqlar bilan birga jamoaviy (xalqlar) huquqlariga va insonning oila hamda jamiyat oldidagi burchlariga katta urg'u berishidir."
  },
  {
    "id": 143,
    "savol": "Amerika inson huquqlari tizimining asosiy hujjatlari qaysilar?",
    "javob": "Asosiy hujjatlar: Inson huquqlari va burchlari to'g'risidagi Amerika deklaratsiyasi (1948) hamda Inson huquqlari to'g'risidagi Amerika konvensiyasidir (1969)."
  },
  {
    "id": 144,
    "savol": "Milliy inson huquqlari tizimi deganda nima tushuniladi?",
    "javob": "Muayyan davlat ichida inson huquqlarini ta'minlashga qaratilgan qonunchilik bazasi (Konstitutsiya, qonunlar) va ularni himoya qiluvchi institutlar (sudlar, Ombudsman, huquqni muhofaza qilish organlari) majmuidir."
  },
  {
    "id": 145,
    "savol": "O‘zbekiston Respublikasida inson huquqlarining konstitutsiyaviy asoslari qaysilar?",
    "javob": "Yangi tahrirdagi Konstitutsiyaning II bo'limi (19-58-moddalar) inson va fuqaroning asosiy huquqlari, erkinliklari va burchlariga bag'ishlangan bo'lib, inson huquqlari ustuvorligi davlatning oliy maqsadi sifatida belgilangan."
  },
  {
    "id": 146,
    "savol": "Konstitutsiyada belgilangan asosiy shaxsiy huquqlarni sanab bering.",
    "javob": "Yashash huquqi, erkinlik va shaxsiy daxlsizlik, qiynoqqa solinmaslik, shaxsiy va oilaviy hayot daxlsizligi, uy-joy daxlsizligi, harakatlanish erkinligi hamda fikrlash va so'z erkinligi."
  },
  {
    "id": 147,
    "savol": "O‘zbekiston fuqarolarining siyosiy huquqlari qaysilar?",
    "javob": "Jamiyat va davlat ishlarini boshqarishda ishtirok etish, saylash va saylanish, davlat xizmatiga kirish, ommaviy tadbirlarda ishtirok etish hamda davlat organlariga murojaat qilish huquqlari."
  },
  {
    "id": 148,
    "savol": "Ijtimoiy huquqlarning konstitutsiyaviy kafolatlari nimadan iborat?",
    "javob": "Davlatning ijtimoiy himoyaga muhtoj qatlamlarni qo'llab-quvvatlash, ishsizlikdan himoyalanish, bepul tibbiy yordamning kafolatlangan hajmini ta'minlash va pensiya hamda nafaqalarning minimal miqdorini belgilash majburiyatidir."
  },
  {
    "id": 149,
    "savol": "Ta’lim olish huquqining mazmuni nimada?",
    "javob": "Har kimning bilim olish huquqi kafolatlanishi, bepul umumiy o'rta ta'lim, oliy ta'lim muassasalarida tanlov asosida bepul o'qish imkoniyati hamda inklyuziv ta'limni rivojlantirishdir."
  },
  {
    "id": 150,
    "savol": "Mehnat qilish huquqi qanday ta’minlanadi?",
    "javob": "Har bir shaxsning munosib mehnat sharoitlarida ishlash, kasbiga ko'ra ish tanlash, xavfsizlik va gigiyena talablariga javob beradigan ish o'rniga ega bo'lishi hamda mehnatiga yarasha adolatli haq olishi orqali."
  },
  {
    "id": 151,
    "savol": "Sog‘liqni saqlash huquqining asosiy jihatlari qaysilar?",
    "javob": "Har bir insonning malakali tibbiy xizmatdan foydalanishi, davlat tomonidan bepul tibbiy xizmatning kafolatlangan hajmi bilan ta'minlanishi va sog'lom atrof-muhitda yashash huquqidir."
  },
  {
    "id": 152,
    "savol": "Sud orqali himoyalanish huquqi nimani anglatadi?",
    "javob": "Har bir shaxsning o'z huquq va erkinliklarini sud orqali himoya qilish, davlat organlari va mansabdor shaxslarning noqonuniy qarorlari ustidan sudga shikoyat qilish kafolatidir."
  },
  {
    "id": 153,
    "savol": "Aybsizlik prezumpsiyasi prinsipi mazmunini tushuntiring.",
    "javob": "Ayblanuvchi uning aybi qonunda nazarda tutilgan tartibda isbotlanmaguncha va sudning qonuniy kuchga kirgan hukmi bilan aniqlanmaguncha aybsiz hisoblanadi. Barcha shubhalar ayblanuvchining foydasiga talqin qilinadi."
  },
  {
    "id": 154,
    "savol": "Adolatli sudlov huquqi nimadan iborat?",
    "javob": "Ishning mustaqil va xolis sud tomonidan, ochiq va oshkora, qonunda belgilangan muddatlarda ko'rib chiqilishi hamda shaxsning himoyalanish (advokat yordamidan foydalanish) huquqining ta'minlanishidir."
  },
  {
    "id": 155,
    "savol": "So‘z va fikr erkinligi huquqining ahamiyati nimada?",
    "javob": "Bu huquq demokratiyaning asosi bo'lib, shaxsning o'z fikrini erkin ifodalash, axborotni izlash, olish va tarqatish imkoniyatini beradi, jamiyatda jamoatchilik nazoratini o'rnatishga xizmat qiladi."
  },
  {
    "id": 156,
    "savol": "Axborot olish huquqi qanday huquq hisoblanadi?",
    "javob": "Bu shaxsning davlat organlari faoliyati haqida axborot izlashi va olishiga oid siyosiy hamda shaxsiy erkinlikdir. Bu huquq faqat qonun bilan (davlat siri yoki boshqalarning huquqini himoya qilish uchun) cheklanishi mumkin."
  },
  {
    "id": 157,
    "savol": "Vijdon va e’tiqod erkinligi deganda nima tushuniladi?",
    "javob": "Har bir insonning har qanday dinga e'tiqod qilish yoki hech qaysi dinga e'tiqod qilmaslik huquqi, diniy qarashlarini erkin ifodalash va diniy tashkilotlarga a'zo bo'lish erkinligidir."
  },
  {
    "id": 158,
    "savol": "Yig‘ilishlar va birlashmalar erkinligi qanday huquq?",
    "javob": "Bu jamoaviy siyosiy huquq bo'lib, fuqarolarning tinch, qurolsiz yig'ilishlar, mitinglar o'tkazish hamda o'z manfaatlarini himoya qilish uchun kasaba uyushmalari va partiyalarga birlashish huquqidir."
  },
  {
    "id": 159,
    "savol": "Shaxsiy hayot daxlsizligi huquqi nimani anglatadi?",
    "javob": "Shaxsning o'z shaxsiy va oilaviy siri, or-nomusi va qadr-qimmati himoya qilinishi, yozishmalar va telefon so'zlashuvlari sir saqlanishiga bo'lgan huquqidir."
  },
  {
    "id": 160,
    "savol": "Uy-joy daxlsizligi huquqining mazmuni nimadan iborat?",
    "javob": "Hech kimning uy-joyiga unda yashovchilarning xohishiga qarshi kirish mumkin emas. Uy-joyda tintuv o'tkazish yoki undan mahrum etish faqat qonun bilan belgilangan hollarda va sud qarori asosida amalga oshiriladi."
  },
  {
    "id": 161,
    "savol": "Inson huquqlari buzilishi deganda nima tushuniladi?",
    "javob": "Inson huquqlari buzilishi — davlat organlari, mansabdor shaxslar yoki ularning ruxsati bilan harakat qiluvchi subyektlar tomonidan insonning qonuniy huquq va erkinliklariga zid ravishda sodir etilgan harakat yoki harakatsizlikdir."
  },
  {
    "id": 162,
    "savol": "Inson huquqlari buzilgan taqdirda murojaat qilish yo‘llari qaysilar?",
    "javob": "Murojaat yo‘llari: 1) Yuqori turuvchi ma’muriy organ; 2) Sud tizimi; 3) Ombudsman (Inson huquqlari bo‘yicha vakil); 4) Prokuratura organlari; 5) Inson huquqlari bo‘yicha milliy markaz; 6) Xalqaro huquqni muhofaza qiluvchi organlar (BMT qo‘mitalari)."
  },
  {
    "id": 163,
    "savol": "Sudgacha bo‘lgan himoya mexanizmlari nimadan iborat?",
    "javob": "Bunga ma’muriy tartibda shikoyat qilish, Ombudsman aralashuvi, mediatrlar yordamida nizolarni hal qilish hamda davlat organlari huzuridagi jamoatchilik kengashlariga murojaat qilish kiradi."
  },
  {
    "id": 164,
    "savol": "Ma’muriy himoya usullari qanday?",
    "javob": "Ma’muriy himoya — huquqi buzilgan shaxsning yuqori turuvchi mansabdor shaxsga yoki organga shikoyat berishidir. Bunda organ o‘zining yoki bo‘ysunuvchi tashkilotining qarorini bekor qilishi yoki o‘zgartirishi mumkin."
  },
  {
    "id": 165,
    "savol": "Fuqarolik jamiyati institutlarining inson huquqlarini himoya qilishdagi roli nimada?",
    "javob": "Ular jamoatchilik nazoratini amalga oshiradi, inson huquqlari monitoringini o‘tkazadi, jabrlanganlarga bepul huquqiy va ijtimoiy yordam ko‘rsatadi hamda qonunchilikni takomillashtirishda ishtirok etadi."
  },
  {
    "id": 166,
    "savol": "Nodavlat notijorat tashkilotlarining ahamiyati qanday?",
    "javob": "NNTlar davlat va jamiyat o‘rtasida 'ko‘prik' vazifasini o‘taydi. Ular davlat nazari tushmagan muammolarni (ayollar zo‘ravonligi, ekologiya) ko‘tarib chiqadi va ijtimoiy himoyaga muhtoj qatlamlar manfaatini himoya qiladi."
  },
  {
    "id": 167,
    "savol": "Ommaviy axborot vositalarining inson huquqlarini ta’minlashdagi o‘rni nimada?",
    "javob": "OAV inson huquqlari buzilishi holatlarini 'kun tartibi'ga olib chiqadi, davlat organlari faoliyatining ochiqligini ta’minlaydi va aholining huquqiy xabardorligini oshiradi."
  },
  {
    "id": 168,
    "savol": "Inson huquqlari ta’limining ahamiyati nimadan iborat?",
    "javob": "Ta’lim shaxsga o‘z huquqlarini anglash, ularni himoya qilish usullarini o‘rganish va jamiyatda boshqalar huquqiga nisbatan hurmat ruhini (huquqiy madaniyat) shakllantirish uchun zarurdir."
  },
  {
    "id": 169,
    "savol": "Bolalar huquqlarining o‘ziga xos jihatlari qaysilar?",
    "javob": "Bolalar jismoniy va ruhiy jihatdan yetuk bo‘lmaganligi sababli maxsus himoyaga muhtoj. Ularning huquqlari 'bolaning eng yaxshi manfaatlari' ustuvorligi va kamsitmaslik prinsiplariga asoslanadi."
  },
  {
    "id": 170,
    "savol": "Bola huquqlari to‘g‘risidagi Konvensiyaning mazmuni nimada?",
    "javob": "1989-yilgi ushbu Konvensiya bolaning yashash, rivojlanish, himoya qilinish va ishtirok etish (o‘z fikrini bildirish) kabi to‘rtta asosiy guruh huquqlarini mustahkamlaydi."
  },
  {
    "id": 171,
    "savol": "Ayollar huquqlarini himoya qilishning xalqaro asoslari qaysilar?",
    "javob": "Asosiy hujjat — 1979-yildagi 'Ayollarga nisbatan kamsitishning barcha shakllariga barham berish to‘g‘risida'gi konvensiya (CEDAW) va 1995-yildagi Pekin deklaratsiyasidir."
  },
  {
    "id": 172,
    "savol": "Nogironligi bo‘lgan shaxslar huquqlari qanday himoya qilinadi?",
    "javob": "BMTning Nogironlar huquqlari to‘g‘risidagi konvensiyasiga ko‘ra, davlatlar ularga to‘siqlarsiz muhit yaratish, inklyuziv ta’lim va munosib ish bilan ta’minlash majburiyatini oladi."
  },
  {
    "id": 173,
    "savol": "Keksalar huquqlari tushunchasini izohlang.",
    "javob": "Keksalar huquqlari — yoshi ulug‘ insonlarning munosib ijtimoiy ta’minot, sifatli tibbiy xizmat olish, jamiyat hayotida faol ishtirok etish hamda qadr-qimmatini kamsitishdan himoyalanish huquqidir."
  },
  {
    "id": 174,
    "savol": "Qochqinlar huquqlari deganda nima tushuniladi?",
    "javob": "Qochqinlar — ta’qiblar tufayli o‘z davlatini tark etgan shaxslar. Ularning asosiy huquqi 'qaytarib yubormaslik' (non-refoulement), ya’ni ularni hayoti xavf ostida bo‘lgan mamlakatga majburan qaytarmaslikdir."
  },
  {
    "id": 175,
    "savol": "Migrantlar huquqlarining asosiy jihatlari qaysilar?",
    "javob": "Bunga mehnat migrantlarining adolatli ish haqi olish, xavfsiz mehnat sharoiti, tibbiy yordam va o‘z oilasi bilan aloqada bo‘lish huquqlari kiradi."
  },
  {
    "id": 176,
    "savol": "Inson huquqlari va milliy xavfsizlik o‘rtasidagi muvozanat qanday ta’minlanadi?",
    "javob": "Muvozanat 'mutanosiblik' tamoyili orqali ta’minlanadi. Xavfsizlik choralari inson huquqlarini faqat qonunda belgilangan darajada va demokratik jamiyat uchun zarur bo‘lgan miqdordagina cheklashi mumkin."
  },
  {
    "id": 177,
    "savol": "Terrorizmga qarshi kurashda inson huquqlariga rioya qilish masalasi nimada namoyon bo‘ladi?",
    "javob": "Terrorizmda ayblangan shaxsning adolatli sudlov, qiynoqqa solinmaslik va aybsizlik prezumpsiyasi huquqlari saqlanib qolishi shart. Huquqlarning buzilishi terrorizmning kuchayishiga sabab bo‘lishi mumkin."
  },
  {
    "id": 178,
    "savol": "Raqamli davrda inson huquqlarining dolzarb muammolari qaysilar?",
    "javob": "Shaxsiy ma’lumotlar daxlsizligi, kiberbullyuing (onlayn tazyiq), algoritmik kamsitish (AI orqali), 'raqamli tabaqalanish' va internetga ulanish huquqi."
  },
  {
    "id": 179,
    "savol": "Internet va so‘z erkinligi o‘rtasidagi bog‘liqlikni tushuntiring.",
    "javob": "Internet so‘z erkinligini amalga oshirishning eng kuchli platformasidir. Davlatlar internetni asossiz bloklamasliklari va onlayn fikr bildirish uchun shaxslarni ta’qib qilmasliklari lozim."
  },
  {
    "id": 180,
    "savol": "Shaxsiy ma’lumotlarni himoya qilish huquqi nimani anglatadi?",
    "javob": "Bu shaxsning o‘zi haqidagi axborotni kim, qachon va qanday maqsadda to‘plashi hamda ishlatishini nazorat qilish huquqidir. Bu huquq 'shaxsiy hayot daxlsizligi'ning bir qismidir."
  },
  {
    "id": 181,
    "savol": "Inson huquqlari va ekologiya o‘rtasidagi bog‘liqlik nimada?",
    "javob": "Inson huquqlari va ekologiya uzviy bog‘liq: yashash va sog‘liqni saqlash kabi fundamental huquqlarni sog‘lom ekologik muhitsiz amalga oshirib bo‘lmaydi. Atrof-muhitning ifloslanishi inson qadr-qimmati va hayotiga bevosita tahdid soladi."
  },
  {
    "id": 182,
    "savol": "Sog‘lom atrof-muhitda yashash huquqi mazmunini tushuntiring.",
    "javob": "Bu huquq insonning toza havodan bahramand bo‘lishi, xavfsiz suv ichishi, sifatli oziq-ovqat iste’mol qilishi hamda ekologik axborotga ega bo‘lish va ekologik qarorlar qabul qilishda ishtirok etish imkoniyatini anglatadi."
  },
  {
    "id": 183,
    "savol": "Barqaror rivojlanish va inson huquqlari o‘rtasidagi munosabat qanday?",
    "javob": "Barqaror rivojlanish maqsadlari (BRM) inson huquqlariga asoslanadi. 'Hech kimni ortda qoldirmaslik' tamoyili iqtisodiy o‘sishni ijtimoiy tenglik va inson huquqlari himoyasi bilan uyg‘unlashtirishni talab etadi."
  },
  {
    "id": 184,
    "savol": "Inson huquqlarini amalga oshirishda xalqaro hamkorlikning ahamiyati nimada?",
    "javob": "Inson huquqlari global xarakterga ega. Xalqaro hamkorlik davlatlarga tajriba almashish, xalqaro standartlarni joriy etish va global inqirozlar (pandemiya, qochqinlar) davrida birgalikda yechim topish imkonini beradi."
  },
  {
    "id": 185,
    "savol": "Davlat va jamiyatning inson huquqlarini ta’minlashdagi o‘zaro hamkorligi qanday?",
    "javob": "Davlat huquqiy va iqtisodiy asoslarni yaratadi, jamiyat (NNTlar, faollar) esa jamoatchilik nazorati va ehtiyojlarni bildirish orqali bu jarayonni takomillashtiradi. Bu 'ijtimoiy sheriklik' modeli deb ataladi."
  },
  {
    "id": 186,
    "savol": "Inson huquqlari monitoringi deganda nima tushuniladi?",
    "javob": "Monitoring — inson huquqlari sohasidagi haqiqiy holatni muntazam kuzatish, ma’lumotlarni to‘plash va tahlil qilish jarayonidir. U muammolarni erta aniqlash va davlatga tavsiyalar berish uchun xizmat qiladi."
  },
  {
    "id": 187,
    "savol": "Milliy hisobotlar tayyorlashning ahamiyati nimada?",
    "javob": "Milliy hisobotlar davlatning xalqaro shartnomalar bo‘yicha o‘z majburiyatlarini qanday bajarayotganini ko‘rsatadi. Bu jarayon davlatning hisobdorligini oshiradi va ichki kamchiliklarni tahlil qilishga yordam beradi."
  },
  {
    "id": 188,
    "savol": "Inson huquqlari sohasida islohotlar o‘tkazish zarurati nimadan kelib chiqadi?",
    "javob": "Zarurat jamiyat taraqqiyoti, yangi texnologiyalar paydo bo‘lishi, mavjud tizimlardagi kamchiliklar va xalqaro standartlarning yangilanishi kabi omillardan kelib chiqadi."
  },
  {
    "id": 189,
    "savol": "Inson huquqlarini ta’minlashda huquqiy madaniyatning roli qanday?",
    "javob": "Huquqiy madaniyat — bu huquqlarni shunchaki bilish emas, balki ularga amal qilish va boshqalarning huquqini hurmat qilishdir. Yuqori madaniyat huquqbuzarliklarning oldini oluvchi eng asosiy 'immunitet'dir."
  },
  {
    "id": 190,
    "savol": "Inson huquqlariga hurmat bilan qarash jamiyat taraqqiyotiga qanday ta’sir ko‘rsatadi?",
    "javob": "Inson huquqlari ta’minlangan jamiyatda ijtimoiy barqarorlik bo‘ladi, investitsiyaviy jozibadorlik ortadi, inson kapitali rivojlanadi va natijada barqaror iqtisodiy o‘sishga erishiladi."
  },
  {
    "id": 191,
    "savol": "Inson huquqlari va qonun ustuvorligi o‘rtasidagi bog‘liqlikni tushuntiring.",
    "javob": "Qonun ustuvorligi inson huquqlari himoyasining kafolatidir. Qonun barcha uchun barobar bo‘lmagan va adolatli sudlov mavjud bo‘lmagan joyda inson huquqlari faqat qog‘ozda qoladi."
  },
  {
    "id": 192,
    "savol": "Demokratik jamiyatda inson huquqlarining o‘rni qanday?",
    "javob": "Inson huquqlari demokratiyaning poydevoridir. Demokratik jamiyatda hokimiyat inson huquqlarini himoya qilish uchun xizmat qiladi va aynan shu huquqlarning ta’minlanishi bilan o‘z qonuniyligini tasdiqlaydi."
  },
  {
    "id": 193,
    "savol": "Inson huquqlarining kafolatlari deganda nima tushuniladi?",
    "javob": "Kafolatlar — bu huquqlarni qog‘ozdan amaliyotga ko‘chirishni ta’minlovchi iqtisodiy (mablag‘), siyosiy (barqarorlik), huquqiy (qonunlar, sud) va ijtimoiy sharoitlar tizimidir."
  },
  {
    "id": 194,
    "savol": "Huquqiy davlat tushunchasining asosiy belgilarini sanab bering.",
    "javob": "1) Qonun ustuvorligi; 2) Inson huquqlari va erkinliklarining oliy qadriyatligi; 3) Hokimiyatning bo‘linishi; 4) Davlat va shaxsning o‘zaro mas’uliyati; 5) Sudning mustaqilligi."
  },
  {
    "id": 195,
    "savol": "Inson huquqlari va majburiyatlar o‘rtasidagi muvozanat nimada?",
    "javob": "Mening huquqim tugagan joyda boshqasining huquqi boshlanadi. Muvozanat — o‘z huquqlaridan foydalanishda boshqalarning huquqlariga zarar yetkazmaslik va jamiyat oldidagi burchlarni (soliq to‘lash, qonunga rioya qilish) bajarishdir."
  },
  {
    "id": 196,
    "savol": "Shaxs, jamiyat va davlat manfaatlari qanday uyg‘unlashtiriladi?",
    "javob": "Bu uyg‘unlik adolatli qonunlar va demokratik institutlar orqali erishiladi. Davlat ommaviy manfaatlarni (xavfsizlik) himoya qilishda shaxsning individual huquqlarini asossiz cheklamasligi lozim."
  },
  {
    "id": 197,
    "savol": "Inson huquqlarini himoya qilishning zamonaviy tendensiyalari qaysilar?",
    "javob": "Inson huquqlarining raqamli transformatsiyasi (kiber-huquqlar), ekologik huquqlarning birinchi o‘ringa chiqishi va inson huquqlari himoyasida sun’iy intellekt hamda texnologiyalardan foydalanish."
  },
  {
    "id": 198,
    "savol": "Globalizatsiya sharoitida inson huquqlarining rivojlanishi qanday kechmoqda?",
    "javob": "Globalizatsiya inson huquqlari standartlarini universallashtirmoqda, biroq milliy qadriyatlar va global me’yorlar o‘rtasidagi ziddiyatlarni ham keltirib chiqarmoqda. Xalqaro nazorat mexanizmlari kuchaymoqda."
  },
  {
    "id": 199,
    "savol": "Inson huquqlari sohasida kelajakdagi asosiy vazifalar nimalardan iborat?",
    "javob": "Kamsitishning barcha shakllariga barham berish, iqlim o‘zgarishi oqibatlaridan insonni asrash, raqamli texnologiyalar ustidan inson huquqlari nazoratini o‘rnatish va ta’lim sifatini oshirish."
  },
  {
    "id": 200,
    "savol": "Inson huquqlari ta’minlashda har bir fuqaroning mas’uliyati nimada?",
    "javob": "Har bir fuqaro o‘z huquqini bilishi va himoya qila olishi bilan birga, boshqalarning qadr-qimmati va huquqlariga hurmat bilan qarashi, jamiyatdagi adolatsizlikka nisbatan befarq bo‘lmasligi lozim."
  }
]

